{"title": "CS 200 vs CS 220", "body": "I’m currently deciding what CS class to take. I have no prior knowledge about anything CS, but my interests have spiked due to an opportunity to worth in the tech industry.\n\nI know CS 220 is one more credit than CS 200, so I would be at 17 credits if I took CS 220 (Math 221, Chem 104, and Eng 100).\n\nI had recommendations to take CS 220 from another post I did, so I’m curious what are your experiences with either.\n\nI saw Andrew Kuemmel had really good rating a on RMP, and Meena Syamkumar had decent. Cole Nelson had none. Jim Williams (CS 200) had average ratings, but I was told some of those ratings are over exaggerating.", "comments": ["A question you have to answer, are you planning to continue going to path of computer science? If yes definitely take 200. If you want to try it out, 220 might be better, but if you decided to continue by taking 300 after 220, there might be a little bit of learning curve as Java (taught in 200) is a more complicated language to learn compared to Python (taught in 220). \n\n220 is more practical (but also more boring imo because it's programming for using data as opposed to 200 which is programming for some simple applications). 200 is more theoretical that will help you down the line if you decided to learn more about CS.", "CS 220 teaches Python which is probably the more practical language to learn, but 200 learning Java is the more standard path. I had Jim Williams for 200 two years ago and thought he was good. Not great, but also not bad. His lectures can be a bit dry, but I feel like the expectations for the projects were reasonable. When I took it, we used Zybooks which is like an participation based textbook. Some people really liked it and others just clicked through to finish it, but I would suggest looking it up to see that type of style. I can't really comment on 220 as I haven't taken it, but you can't go wrong learning Python.", "i havent taken 220 with andy kuemmel but from what i know about him he's very invested in making sure his students make the most out of his course. this semester there were a couple of students who were behind on projects by about 3-4 week and he let them submit their projects later (usually teachers will just give you a 0 without taking to you about it)\n\nbut if youre interested in a cs career taking 200 is more important, you can take 220 later when you have some understanding of how to code"], "url": "https://www.reddit.com/r/UWMadison/comments/r33q66/cs_200_vs_cs_220/"}