{"title": "CS 320 or STATS 240", "body": "I'm planning a double-major or getting a certificate in Data Science, and I'm decided on which one is less stressful for the spring semester in terms of **work load** and **exams,** because having 13 projects for CS 220 was a bit time consuming.  If anyone has any feedback on any of these two classes (CS 320 or STATS 240) I'd greatly appreciate it.", "comments": ["I took CS320 last semester and am currently taking STAT 240.\n\nCS 320 does have a project due every week. But if I remember correctly, the late work policy was turn in a project that passed 50% of the tests on the due date and you get an automatic 3 day extension (I took advantage of this every week). The only exception was the last project since they needed to have final grades in on time. Last semester, labs were required for attendance (but there was no work to turn in, just prep for the project due that week). There was a small weekly quiz but you were allowed to work with your assigned lab group on them. There's also 3 exams (2 midterms + final), but they're all multiple choice.\n\nSTAT 240 has a homework due every week. The homework is very time-consuming. The late work policy is an automatic 50%, plus the deductions from getting the questions wrong. Discussion is required for attendance. There is an assignment to do in every discussion, but it's graded based on if your group attempted the work, so you don't have to finish it. There is also a final group project (which I hate with a passion). You get to choose any dataset of choice, but you have to orally present it to your discussion section. There are 2 exams (one midterm,  one final). There is a multiple choice section and a take-home section, which is similar to the homework, but under a time constraint.\n\nPersonally, CS 320 seems like the lighter class. Both classes are going to be time-consuming, but stat 240 is a bit disorganized."], "url": "https://www.reddit.com/r/UWMadison/comments/yytc4r/cs_320_or_stats_240/"}