{"title": "Should I take CS 300 or CS 200", "body": "Hi there. I'm debating between which CS  course to take next semester. I have the AP Credit to jump right into CS 300 but I'm not sure if I should. I took AP CS 3 years ago. I still remember big ideas and like if I brushed up on my syntax I could code again (I was naturally pretty good at coding) but I'm not sure if I should use my AP credit or not. Is CS 200 a weedout course? I noticed on madgrades that students on average tend to do worse in CS 200 by 0.21 GPA points. ", "comments": ["There's a test you can take on the cs200 website that tell you if they think you should skip the class or not.", "If you are naturally good at coding you can skip CS200. I skipped CS200 and I'm having no problems right now in CS300, and I believe they teach you really basic things in CS200 like if/else statements, etc.", "I took CS 300 Spring 2018. I took APCS in high school for a full year during 2013-2014, my junior year, so I had 4 years off from programming in java.\n\nI got an A in CS 300, and I had Gary Dahl as my instructor.\n\nThe very first assignment almost always involves a 2D array, so you will have to be familiar with nested for loops and arrays entering the class. You do not have to be familiar with making your own classes (object-oriented programming).\n\nMy APCS class was very rigorous now that I look back at what we covered. We made our own objects, covered binary trees (a CS 300 topic) as well as hashing (a CS 400 topic). Before APCS, we also had a year of computer science coursework in Visual Basic.\n\nI think CS 300 is probably the class for you. On the course website there should be a sample assignment to test your readiness. It’s not completely necessary you do it (I didn’t), but with winter break coming up, you might be able to find them time to do it before the semester starts.\n\nA reason not to do CS 300 would be if you didn’t get that much depth out of your APCS class and want to completely start over. If you start in 200, the majority of content would probably be too easy though."], "url": "https://www.reddit.com/r/UWMadison/comments/9tv68h/should_i_take_cs_300_or_cs_200/"}