{"title": "What’s covered in CS 320?", "body": "Going into my Junior year as a CS major and am wondering if it will be worth taking? I took CS 220 last semester and felt like it was very useful but most of it I could have learned on my own with prior java knowledge and stuff. The main issue trying to learn Python on my own was I didn’t know WHAT to learn but this class had a good range of topics I didn’t even know we’re possible with Python.\n\nIs 320 worth taking or could I learn the topics faster on my own? Could you all share some of the topics or most important stuff from the class. I am really interested in doing more with web scraping and SQL databases. I’ve taken up until CS400 with java if that gives you some perspective.", "comments": ["I don't know anything about CS320, but I can suggest some topics to look for if there are existing syllabi:\n\nWeb scraping: BeautifulSoup! It's a glorious wonderful amazing brilliant Python library for exactly this. I adore it to pieces.\n\nSQL databases: Tough one. CS typically teaches you to build a database *system*, not an actual database. If you're working on the Digital Studies certificate you could take LIS 351, but if not I wouldn't recommend it just for that single (short) SQL/design unit. I hear there may be an undergrad-focused database course on its way, however; keep an eye on LIS/iSchool offerings.\n\nThat said, SQL isn't difficult to learn on one's own for many people. Beyond the basics it can get weird -- source: me, query optimization absolutely bewilders me -- but the basics are most of what regular folks use anyway.", "https://tyler.caraza-harter.com/cs320/s21/schedule.html \n\nThis is what we covered last semester in 320, take a look through and see if you like the material. Be prepared to do a lot of review on CS300/400 concepts in the first couple of weeks. I found the topics interesting but slightly disjointed; we went from graphing using geopandas to machine learning in basically a weekend. There is a good 1.5 weeks worth of webscraping in there, mostly using selenium. We didn't cover anything related to SQL though, so keep that in mind. \n\nMy recommendation would be to watch the webscraping videos by yourself and learn them that way (pretty sure the videos are public so you shouldn't have issues watching them). I don't think it's worth it to take CS320 considering the workload (projects weren't hard but fairly time consuming). There is another database class (CS564) which I haven't taken that is completely dedicated to databases and SQL. We covered some other fun stuff with machine learning but again taking a more in-depth course (CS540 among others) on that would probably be better."], "url": "https://www.reddit.com/r/UWMadison/comments/nplmh3/whats_covered_in_cs_320/"}