{"title": "CS577", "body": "I am taking CS577 Intro to Algorithms this Spring and I haven't heard good things about this class and the fact that >85% is an A and >60% is a B is concerning enough. What are some tips on how to tackle this class during the semester to ensure I don't fall behind and do well?", "comments": ["The class is very easy to BS your way to an A imo. I did all of the participation work and studied an adequate amount for the quizzes (nothing crazy, like 5 hours) and went into the final with a ~94%. I then just printed off all the homework’s and bullshitted every answer based on that. I somehow got a 60% on the final which netted me an A. \n\nMost people get hung up on the time constraint and freeze up. There’s 5 questions and doing each one adequately probably takes about a half hour without the stress of the final. Hell, I have friends that spent the entire first hour on the first question. \n\nThe course is structured awfully and in no way promotes actually learning the material. It’s very easy to gamify. I spent more time on my 1 credit CS course this semester than I did algos. If you want to actually learn you have to be self motivated, but as a college student balancing a million other things this is obviously easier said than done. \n\nI feel like the course has developed this mantra of “algos is hard so we’re going to make it hard” which just leads to a complete joke of an exam that rewards randomly throwing up content. Imo it needs a complete overhaul.", "You will be fine if you show up to class, make an honest effort on your homework to understand each problem, re-watch portions of the lecture you don't understand the first time, re-work the problems in discussion if they don't make sense to you (ask the peer mentors or TAs if you need extra explanation). Also if there are extra credit opportunities (we had ZyBooks and the lecture TopHats) then don't let those go either. The final exam has acually a quite generous curve so if you are moderately prepared you'll at least get the class average. I wouldn't be concerned about getting less than a B if you're giving the class an honest effort.\n\nThat sounds like a lot, but it has a reputation as a tough class for a reason. There's not really a secret to doing well, you just need to spend the time to review material that doesn't make sense until it does make sense, and use the resources avaiable (office hours, Piazza, etc.) to make that easier."], "url": "https://www.reddit.com/r/UWMadison/comments/18t7mby/cs577/"}