{"title": "CS course selection: CS571 vs CS506 and CS532 vs CS540", "body": "Its that time of the semester guys!\n\nI need to choose 2 classes, any suggestions?\n\n1. CS571 vs CS506\n2. CS532 vs CS540 (haven't taken 340 tho)\n\nWhat am I looking for:\n\nBasically, interested in getting a good experience of the SW development cycle and the tech-stacks etc related to it + a well structured class with a good 'learning' experience :/ \n\n(I know 571 is frontend/react etc which i am really interested in but i could also do that online lol, is it worth it? really confused.)\n\nAlso interested in taking an AI/ML course to get into that field but have no prev background  :(\n\nif u have any other course suggestions, lmk.\n\nThanks in advance!", "comments": ["if possible i’d recommend choosing cs639 capstone over cs506, you learn agile and get to work on a project for both classes, except you get to work with a real company in cs639 and you won’t end up with a really bad prof that rambles like in cs506", "1. CS 571\n\nI would have said CS 506 because it’s software engineering but there is only one professor and he is horrendous.\n\n2. CS 540\n\nI’m taking it right now. It’s a great class and covers several areas of AI. 70% of the grade is 10 homework programming assignments that aren’t too bad and you get to drop the lowest 2. About not taking Math 340, my professor at least spent a good amount of time going over linear algebra basics.", "Haven't taken any of the classes in the first point, but regarding the second point (between 532 and 540) I would (barely) go with 532 over 540 based on your math experience. 532 is definitely possible without doing linear algebra as they do teach a lot of it to you, but it is also definitely more difficult. I have not taken 540 but I've heard its pretty well structured and has good projects, but also seems to be thought of as more of an essay class. Seems to be a pretty good intro to AI/ML though."], "url": "https://www.reddit.com/r/UWMadison/comments/1bw79lr/cs_course_selection_cs571_vs_cs506_and_cs532_vs/"}