{"title": "Advice before taking CS 577 (Algorithms)?", "body": "I finished CS 240 this semester, and I will be taking CS 577 in the Spring. I really want to do well in this class. I managed to just barely crack an A in 240, and I hear this class is really important for developers. Although I got a good grade in 240, my data structures is a little weak; I got a very low B in 367. Plus, I don't have much practice in data structures since taking the course about an year ago.\n\nI'm taking it with Professor Shuchi Chawla. From what I've seen on Rate My Professor, she's merciless. Also lots of people tell me 577 is pretty much the most brutal CS course. Can anyone who's taken one of her classes, or has taken 577 before, give me some tips or words of advice? Are there any concepts from 240 I should brush up on before taking 577? I find myself pretty bored over this break, and I could spend the time going over some concepts before the semester starts. Is there a textbook that's really useful for this course?\n\nThanks for the help!", "comments": ["Get lube. ", "I took this course with Suchi. The best advice I can give is to give yourself a ton of time to complete the homeworks. If you procrastinate, it's going to be awful. The above advice of taking the course with a friend is also good since all the homeworks are done in pairs.\n\nThe course really isn't that bad if you take it seriously.\n\nEdit: and make sure you attend lecture (and discussion if you need it)", "Hey! I just took 577 this past semester and scored a high B. My biggest piece of advice is to not go in alone. Having friends to work on the HW with you is really helpful. Note I did not take with Shuchi, I had Bach.\n\nIf you need to make friends, just go to the TA office hours and talk to the other people who are there. They are just as confused as you, I promise. \n\nThe TAs are extremely helpful too. They will lead you in the right direction on the homeworks and explain concepts you missed. That said, you can understand how things work a lot of the time in algorithms, but you won't be good at applying it unless you practice. So doing practice problems or looking at examples of problems online are your best bet for studying for exams. \n\nI'd start the HWs early too if I were you. I'd reccomend starting early, then taking it to the TA to confirm you are going in the right direction/solving the problem correctly. \n\nBest way to learn though? Doing practice problems. Reading the textbook is helpful but it is extremely dry, for that I'd reccomend going to lectures. I've heard Shuchi is a great professor, she's just hard. \n\nBy the way, I'd take the Rate My Professor scores with a grain of salt. Eric Bach (my prof for 577) has like a 1.7 on there, but he's a fine professor in my opinion. People were just salty they weren't doing well in the class.\n\nGood luck this semester! \n\nEdit: Honestly the only thing I used from 240 was proof by induction / proof by contrapositive. As long as you remember how to prove algorithms work you shouldn't need to brush up on anything. \n\n"], "url": "https://www.reddit.com/r/UWMadison/comments/5l3qwg/advice_before_taking_cs_577_algorithms/"}