{"title": "Barely staying afloat in CS 320", "body": "I am legitimately struggling in this class. Last Semester, I took CS 220 with Meena (she's great) and it was a fair amount of work, (I did fairly well in the class and got a good grade) while having very little to no programming experience. But CS 320 has been a totally different experience for me early on. Prof Caraza-Harter is a great professor don't get me wrong, he is very knowledgeable and does a good job of explaining topics, but I feel like the learning curve for this class (especially for applying them to the projects) is a bit overwhelming for me. We were just assigned groups but people can be busy and sometimes unresponsive in them, as well as OH being incredibly busy (it's getting a bit out of hand lol). Does anyone have any tips or suggestions for this class? I know its only the third week, but I feel like I'm gonna email Prof Caraza-Harter at this point", "comments": ["I was pretty much in the same boat as you last semester. I thought Prof. Caraza-Harter was expecting a bit too much when it came to the projects, especially in the beginning ( The projects get much easier as the semester moves on) . My advice would be to:\n\n1. Build a good relationship with my student mentor and group members. Trust me, you're not the only one struggling with the projects. I'm sure some of your group members would be eager to collaborate. \n2. Go to office hours early. Like 1 hour early. I know it sounds like a pain but it's completely worth it to be first in line. Also, try to go for the early morning sessions. \n3. Start your projects at least a week before they're due. In fact, try to set up the first few parts of the projects even before that. Office hours aren't crowded 2 weeks before the project is due and TA's are generally more helpful during that time since they don't feel rushed. \n\nBest of luck!\n\nPS. Project 2 is the hardest. It took me 9 days of constant work to complete that one. So get started ASAP on that one.", "How do you know what the final grade curve for this class is already? I couldn't find any historical data for this class, so I think it may be new. It appears that Prof Caraza-Harter's final grade curves are very forgiving historically: [http://wisc.alext.se/instructor/ccd16148c5](http://wisc.alext.se/instructor/ccd16148c5) . It looks like she tends to curve upwards towards A.\n\nObligatory, you aren't judging yourself by raw score are you? E.g. some upper CS classes get their raw score 20%-35% mapped to the C bin and a 50% an A. I think you'll be okay.\n\nWhat's the class topics about, maybe I can suggest some supplementary resources?", "I do not know the final grade curve for CS 320. My bad if I made it seem like I did. I just know I did well in CS 220 because I got an A. CS 320 is Data Science II, which I think turned into a class a few couple years back. (I think it might have been the follow-up class of CS 301). My worries aren't necessarily associated with the grade I'll receive, but more of how to approach the class and keep on top of what we are learning. For topics wise, we're doing stuff with Git, and Classes right now, but using virtual machines is probably the most confusing to me."], "url": "https://www.reddit.com/r/UWMadison/comments/lhray2/barely_staying_afloat_in_cs_320/"}