{"title": "Take both CS 200 and CS 220 in the same semester?", "body": "Hello! I am going to be a freshman this fall and I was wondering if its ok to take both cs 200 and cs 220 the fall semester as I was looking into doing a major in CS but a certificate in Data Sciences. Would the two CS classes be too much for one semester, especially for a freshman? Also, I have experience in Python and I am currently learning Java, but I by no means am an expert in both of these languages,", "comments": ["It can be quite confusing learning both languages at the same time especially if you’re a beginner.", "I suggest you schedule an appointment with an advisor to give you specific guidance. \n\nIn my personal experience, you can pay for whatever class you want, and sink or swim (where it benefits or does not benefit you academically). The question is, is it advisable.\n\nIt does say on the SOAR site that 220 is for presumptive Data Science majors and 200 is for presumptive CS majors.\n\n[Source](https://www.cs.wisc.edu/computer-sciences-at-soar/)\n\nEdit: another thought,\n\nI found it helpful to reserve a few entry classes for later in my college career. That way, I could balance harder classes with ones I still need that I can be confident in. So perhaps the solution is to pick one, and take the other (if and only if you absolutely need to).\n\nMy biggest mistake in college was taking courses that didn’t help me graduate. It cost money and more importantly it costs time. The goal is to graduate. In the industry you will always have opportunity to continue education and keep learning new things, but try to be focused on what it takes to graduate in your chosen field. I do this by meeting with my advisor often.", "I know it's not the same exact thing, but I'm taking CS300 and Stat 240 (R language) rn, after taking APCSa (CS200) in high school, and CS220 and 320 last year. \n\nI'd personally wait to take CS220. It isn't necessarily a difficult class, just a time intensive class. \n\nI found that I found concepts in CS300 easier after CS220 and 320, but the actual syntax harder (because I had gotten rusty). Rn, I am able to keep R and Java separate but they're pretty different, and one is all like graphing and analysis work and other other is OOP. \n\nI think if you have to get these classes done ASAP and have excellent time management skills then sure, take them together. If you don't have to, I'd just recommend taking CS200, whichever math you need, and get some gen eds out of the way. Honestly even maybe get your Comm B out of the way with LIS 461- it was a super fun class, and it was a lot of writing but if you do the work you'll easily get an A. You can take Comm A and comm b at the same time if you need to."], "url": "https://www.reddit.com/r/UWMadison/comments/oxlfrz/take_both_cs_200_and_cs_220_in_the_same_semester/"}