{"title": "Taking summer classes", "body": "Im thinking of taking either econ 102(macro econ) with Gwen Eudey over the summer or Econ 310(statistics in economics) with Chris McKevley.\n\nDo you think either is doable(as in getting an A) in a 5-6 week course?", "comments": ["I don't have experience with either of those specifically, but I will share my experience taking a summer class (math 234, french 102 and 201? it's been a while) - the compressed timeframe is compensated for by the fact that you're not taking other classes at the same time. You're just focusing on one thing, it's got all your scholastic concentration, and I actually found that I learned the material *better* despite having less time to learn it.", "I think you can get an A. Both of those instructors are great. I’d say Econ 310 might be the best choice because then you’re guaranteed to get McKelvey (David Hansen during the semester isn’t great), and some people report 310 being quite difficult, so being able to focus 100% on it would be beneficial.", "I took Econ 310 online with Mckelvey this summer. It was a really, well done course imo. Every Monday through Thursday, you had a small/medium size (typically somewhere between 20 and 40 page) reading to do, but the readings weren't very necessary (I stopped doing them after the first week and just skimmed them afterwards). You also had 45 minutes to an hour of lecture videos to watch those days before doing a small homework assignment online. Fridays, you had to take a timed quiz (I think the timing was all of them were an hour). Daily, I did just over an hour of work a day for the class. I watched the lecture videos while taking notes, did the homework, then on Fridays did a short review of my notes from that week before taking the quiz.\n\nThe end of the semester you had to take a final that was comparable in difficulty to that of the weekly quizzes. There weren't any midterms so this was the only \"exam.\"\n\nI ended up getting an A in the class, Mckelvey gives you the better grade off of two scales. Either a 92 and above gets you an A, or if your score in the class is a high enough percentile on the curve you'll get an A, so the curve can't hurt you it can only help.\n\nI thought it was a quite manageable class for the amount of content that it covered in that period of time and Mckelvey is fantastic at teaching the content. The lecture videos were great and Mckelvey is really easy to get a hold of if you have questions. I'd absolutely recommend the class. I think I covered just about everything, but if you have any other questions feel free to ask."], "url": "https://www.reddit.com/r/UWMadison/comments/7os2st/taking_summer_classes/"}