{"title": "CS 200 Jim Williams", "body": "I am in CS200 with Jim Williams and whenever I feel that I do well on an exam I don’t. I am doing fine on zyLabs and other participation activities, but my first exam grade was a 57%. Does anyone happen to know if there is some sort of curve in this class or if not, if there are any amazing CS tutoring services on campus? CS is very new to me so any guidance or feedback is appreciated!!!", "comments": ["There wasn’t a curve when I took 200-300-400. \n\nTalk to Jim. He’s really excellent in office hours imo. I remember getting 66% for my second midterm, so I went over the midterm questions with Jim during office hours and he gave really helpful advice for the questions I screwed up. I ended up getting 96% for the final.\n\nHighly recommend going over the midterm with a TA or professor. It’s very likely questions of a similar nature will appear for the finals as well", "Definitely start preparing for the final, I took 200 last spring and I don't think there was a curve, a friend told me there was- but it was like .5% which doesn't make much sense to me. Do they still have the policy where if you do better on the final that it replaces your first 2 midterm grades? \n\nIn this class it's really the little details that matter, to me it was helpful to review all the zybooks chapters- it's a lot of material and it sounds awful but just read through them again- at the end because you understand the material now and you'll pick up the finer details that went over your head the first time.\n\nI got points off on the last exam because I didn't know things like what the null character for chars were, how to use for each loops, some of the more obscure conditional statements, how to compile something in the command line, etc.\n\nAbsolutely do not be afraid to go to office hours, I never went to Jim but the best TA in my opinion was Connor- dude helped me so much and answered a million questions for me", "Maybe try going to Marc's lectures. They're pretty entertaining, and I think he explains things more in-depth which will help for understanding and tracing code."], "url": "https://www.reddit.com/r/UWMadison/comments/dxty7g/cs_200_jim_williams/"}