{"title": "How to be successful in CS 537?", "body": "I'm planning on taking this class but I am terrified because of what everyone is saying about it. Would love to hear about how people got through it.", "comments": ["It's very manageable if you:\n\nIdentify a partner that will put in the work with you\n\nStart projects when they come out and do a bit of work every day until it's finished\n\nUtilize office hours to understand the projects", "537 really isn’t as hard as everyone talks about it as long as you do a few things:\n\nStart projects early, I mean look at them the day they are announced and start building a plan, especially if you want to work with a partner and split the work effectively.\n\nGo to office hours or study groups if they are offered. TAs and Peer Mentors are there to help you. Most of the time while they may not be able to diagnose your exact problems in code, we can at least help you with the debugging or list common errors you may have made, or just be another resource to get you started. Plus we can clarify questions about the lecture material in a way that may make more sense to you. Study groups are also great to get overviews of concepts and work with other students under the guidance of course staff.\n\nWatch Remzi’s videos. He wrote the textbook, he knows his shit and he explains it well and thoroughly. You can find previous course websites where he links not only lecture and discussion recordings, but also introductions to xv6 (the mini-OS you work with) and starters to old projects (the projects change each year, but they have to cover the same general topics, so things are always cross-applicable)\n\nYes it’s hard, but there’s so much support available to be utilized if you take advantage of it. The only real insurmountable difficulty is it will take a lot of time to do the projects, but that’s the case with most project based CS classes.", "Take it over the summer if you can. Having solely that class to focus on really make it a lot easier. If you can afford it, I'd highly recommend going the summer route."], "url": "https://www.reddit.com/r/UWMadison/comments/u2rltp/how_to_be_successful_in_cs_537/"}