{"title": "CS 320 (Data Science Programming II) vs. CS 564 (Database Management Systems: Design and Implementation)", "body": "I'm currently enrolled in CS 320 and waitlisted for CS 564. If I get off the waitlist for CS 564, I'm not sure if I want to take two data classes next semester. However, I'm having a difficult time figuring out what each class teaches. \n\nHow would you compare the two classes? What are the projects like? What languages are used? What type of person would benefit from taking one over the other?", "comments": ["Idk about 320 but I'm did 564. If you're looking for a data analysis or database design class this is not really it. There's like a bit of sql/database design in the beginning but like 2/3 of the class is how to actually code a database and how they work in terms of machine organization, memory management etc. We had one sql/python assignment but the rest is in c++ coding more low level things like buffer management and join algorithms. \n\n So if you want to learn how databases are actually implemented and how they work under the hood, this is the class for you. If you want to learn sql for business analysis or something you don't do a lot with that", "I’ve taken and PM’d for CS 320. 320 (as it’s been taught the past 5-6 semesters I believe) is 7 projects across the semester, weekly labs (for attendance points), 2 midterms, and weekly quizzes (they’re open note, and you can code questions/answers to check them). With that being said, the projects take up the bulk of the time. It’s all done in Python, but if you’re coming from the Java side, the first project will help with getting you at least partially up to speed.\n\nThe class is designed for students interested in the data science major, and is the second programming class required for data science majors. You can see all of the class content [here](https://www.msyamkumar.com/cs320/s23/schedule.html) from this semester to get an idea of what it teaches too. I would say that it is mostly analogous to CS 300, with less of a focus on data structures and more focus on data wrangling, manipulation, and ultimately data prediction with machine learning.\n\nI haven’t taken CS 564, but from what it sounds like and since it is a 500-level course, I believe it is more work that 320, and often tougher projects that 320. With that being said, I don’t think that doing both is unrealistic depending on the rest of your schedule.", "CS320 teaches code for data analysis and some flask (very useful class)while cs564 spends some time on querying databases and then just talks about internals of databases and asks you to code it using C++. A lot of students get baited into taking cs564 thinking it’ll be database design class. Tbh the university needs a course that just focuses on very complex sql and database design/administration…"], "url": "https://www.reddit.com/r/UWMadison/comments/12mnhgy/cs_320_data_science_programming_ii_vs_cs_564/"}