{"title": "Next semester: CS 577, CS 540, and CS 532", "body": "Would I be killing myself if I took these classes together next semester? On ratemyprofessors, Marc Renault (577) is rated 3.5, Fred Sala (540) is rated 4.7, and Eduardo Arvelo (532) is rated 5 if that matters. My fourth class is LIS 461 (without discussion).", "comments": ["I don't really know about 532 since I haven't taken it, but I took 540 last fall and am currently in 577 so I can tell you what those are like:\n\n CS 577 with Renault is nowhere near as hard as I expected, most of the homework's are completion and the every-other-week quizzes haven't been too bad. The coding portions to each weekly homework is only worth 1 point out of the 15 so many students don't do a lot of them. Also attendance isn't as strict as I thought it would be, you only have to go to 80% of the lectures and 80% of the discussions to get full credit. I've heard Renault has a generous curve in his classes too, everyone has been saying that it's easy to get a B if you just put some effort into all the assignments/quizzes and show up to lectures/discussions. I haven't finished the class or taken the final obviously, so I can't say for sure if the curve thing is true. The workload has been pretty minimal, all the coding assignments can be done in either python, rust, c, c++ or java so you can use whatever you're most comfortable with.\n\nI took CS 540 with Sala last fall and I struggled a ton with it, but that was because I hadn't taken discrete math or linear algebra. That class is pretty math focused, so they spend the first week of class doing a linear algebra and discrete math crash course, but it wasn't quite enough for me. I did manage to get a B despite not doing great on the exams, so I think Sala is similar to Renault, where if you put in a bit of effort into everything you'll likely be fine. If you've taken discrete math (which you must have to be signing up for 577), then I think this class won't be too hard. I remember half of the coding assignments being easy, we used python and a lot of libraries.\n\nI should also mention that 540 and 577 both have weekly coding assignments so that might get overwhelming, especially if you haven't used python before, since that's what they use in 540. I think if you find friends to study with & get the homeworks started early, you'll be fine for 540 and 577 together, but there will be a few weeks where you're gonna have to put in a lot of work."], "url": "https://www.reddit.com/r/UWMadison/comments/17vtaw2/next_semester_cs_577_cs_540_and_cs_532/"}