{"title": "CS 200 vs CS 220", "body": "I have no experience in programming but am looking to major or minor in comp sci, but there is a slight chance on me majoring data sci instead (depends on the course requirements in fall 2020). \n\nIts said that CS 200 is for comp sci majors but I’ve heard java being incredibly difficult and im really wondering if doing CS 220 is better for me since its more doable learning Python. Any ideas?", "comments": ["Well, java is far from incredibly difficult. That being said, CS200 can be quite challenging for a programming newcomer, both because java is a bit more explicit in the way you write code, being a statically typed, general purpose programming language, and because CS200 as a course can seem demanding, since it’s a first college level coding class for most. I think that if you are thinking of CS, you should take 200. It is more work, but it comes with a benefit of a fuller, more thorough introduction to the basics of programming. Historically, python was created as a small scripting language, the sole purpose of which was to be easy, and abstract away things other languages made explicit. Over time python grew and popularity, and these days it is used for many things, because of a number of reasons, so it is quite useful, but it conceals away many important programming concepts. If you decide to take 220, taking 300, 400 and advanced classes like 354, 540 and 537 might prove more challenging should you choose to do so, so if you are not fully committed to the data science major, I would take 200. I am actually a former TA for the course, and I can tell you that for one, the course has been altered in difficulty since last fall, so it’s not as bad as many people remember it these days. If you put in honest work, you can do great!", "From what I understand (my roommate is a CS major), you'll have to take CS300 and CS400 if you want to major in CS. If you don't know, those are both in Java. CS200 was a cakewalk for me and I also went in with no prior experience. It is also to my understanding that you'll eventually have to learn Python as well. In my opinion, learning a second language is MUCH easier than the first. The hardest part of programming is getting into a \"programming mindset\". \n\nFor example, I don't know any python, but I still am able to help my roommate with his code because I understand how coding works and what problems commonly occur while coding from my work in Java. If you're interested in programming then you'll be fine with these entry level courses.", "CS200 is pretty elementary and teaches you how to think about programming as well as the basics of Java. I didn't find it particularly difficult as long as you follow the lectures and the zybooks assignments."], "url": "https://www.reddit.com/r/UWMadison/comments/eqq41y/cs_200_vs_cs_220/"}