{"title": "Taking CS577 as a sophomore?", "body": "Freshman in CS here trying to plan out my future courses. I've heard that it's best to take 240 in the fall followed by 577 in the spring, and that 577 is useful for interviews so it's helpful to take it early. My current plan is:\n\nFreshman fall: taking CS300\n\nFreshman spring: CS400, CS252\n\nSophomore fall: CS354, CS240\n\nSophomore spring: CS577\n\nHowever, I know 577 has a reputation for being difficult, so I was wondering whether it might be a better idea to wait a year until I have more CS classes under my belt. Would that be worth it? If so, would it also be a good idea to move 240 back a year to keep them back-to-back, or is 240 helpful in other classes I would take?", "comments": ["577 is difficult because it's a theoretical class. There's no programming projects. It's much more similar to a 500 level math class than any other CS course, so there aren't really any CS classes other than 240 that will prepare you for it. It's probably a good idea to take them back to back, but that could be your freshman year or your senior year.", "Having more CS classes is not going to help with 577 in my opinion, as no other class besides 240 really teaches anything related/in the same way as 577, which is entirely proof based and theoretical. \n\nI would say that having 577 under your belt will actually help you with the later CS courses just in terms of being able to recognize what kind of problem you’re solving, so doing it before any of your upper level electives is a good idea.\n\nThe schedule you have there is pretty much exactly what I did which was totally manageable, and I frankly see no reason to postpone 577 or 240 by a full year.", "240 is really only useful when taken right before 577, so keep them back to back. One thing you’ll want to think about is if/when you take MATH 340 since I don’t see that in your plan. That’s needed for many advanced MATH/CS classes, so you may want to take that sophomore year (along with some other CS electives) and then move the 240/577 sequence to junior year. Since 340 is a prerequisite for more classes and 240/577 is more of an independent sequence, I think it’s better to take earlier, but there are certainly benefits to taking 240/577 earlier as well!\n\nOf course, if you’ve already taken MATH 340, then I think your plan looks great, as-is :)"], "url": "https://www.reddit.com/r/UWMadison/comments/qovldd/taking_cs577_as_a_sophomore/"}