{"title": "How hard would it be to take Econ 102, Hist 101, Soc 210, and Genetics 133 for a freshman?", "body": "Currently taking Econ 101, hist 160, Geosci 109, and math 221 and I want next semester to be a tad easier.", "comments": ["You dont need to worry about history or geo sci, as far as econ and math that's all up to how good you think you are at math and econ. I took 101 and 221 the same semester and did great, but I took econ and calc in high school so the classes were familiar already. I think this schedule will be fine, the only way I see it not being ok is if you're pretty bad at math or get hard/shitty professors. I reccomend Pauly for Econ if you can get her. ", "I've taken Hist 101 and when I did, it was a super manageable workload. Two papers (8 pgs total), a noncumulative quiz every three weeks throughout the semester, a map quiz, and 40ish pages/week of readings. However, I know Whiting (the professor I had/the person who's been teaching it regularly the past couple of years) won't be teaching it next semester so my input might not be much help. Regardless of who teaches it though, you should expect to be doing a good chunk of reading and writing since it is a history course so you should take that into consideration when considering how it will be work-wise with the other classes you want to do. \n\n(As a side note to you or anyone really, I'd say if you were interested in 101 that you should consider waiting to take it when Whiting is teaching because she is honest to god a) the best professor I've had and b) one of the nicest people I've met at UW but I get that sometimes you just gotta stick gen ed stuff wherever it fits in your 4ish year plan lol)\n\nAs for the rest of the classes, I wouldn't know since after my first semester here I've pretty much just been taking history and psych classes to get through the majors lmao But good luck figuring it all out!", "I took Genetics 133 last year, and it was a breeze. 3 quizzes, 4 exams but your lowest exam gets dropped, some article reviews, and participation in class make up your grade. Overall, it was a very easy class that was also entertaining. [Here's](https://send.firefox.com/download/81ed317381/#edRfg5015kBo32BpHDFgOg) the syllabus from last semester if you're interested."], "url": "https://www.reddit.com/r/UWMadison/comments/9tehe8/how_hard_would_it_be_to_take_econ_102_hist_101/"}