{"title": "What topics are covered in CS 200?", "body": "Hello all,\n\nI am a prospective CS major. I'm really interested in the possibility of skipping CS 200 and just learning what I need from the class over my free time this summer. Does anyone know a comprehensive list of topics that are covered in the class? Like an old syllabus?", "comments": ["From the Syllabus:\n\nProblem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques.\n\nAs a side note, I initially tried to jump to 300 after taking AP Comp Sci in high school (junior year), but later moved back down to 200 after finding I was in way over my head (I also dropped CS as a major, but that's another story).\n\n I would recommend taking 200, as 300 tends to build off a lot of the topics I just mentioned, but if you feel up to the task of learning it over the summer, go for 300, I'm not your dad. ", "I took AP CS junior year of hs and skipped 200 and went straight ahead to 300. I found the first half of 300 to be pretty easy and the material somewhat repetitive to what I learned in AP CS. The new basic data structures introduced in the first half like linked lists, stacks, and queues are pretty easy and quick to learn imo. The second half though introduces somewhat harder topics like trees and search algorithms as well as big\\-o complexity analysis. The projects are a little time consuming but overall not difficult and sometimes fun to do. I had Gary Dahl and while he seemed like a nice guy, he was very boring for me. It was hard for me to pay attention in class and I found his lectures to be very redundant. I also really hated his exams because I felt like it was testing me on random cs trivia and not whether I actually understood the content. From what I heard from my friends, their professor for 300 in Spring 2018 gave much better and easier exams. Also, I'm not sure if Deb will be teaching 300 but I had her for 400 and she was amazing. Gary almost made me drop CS because while the class wasn't hard, I found it to be mind numbingly boring. Deb however, was super engaging and gave very fun lectures albeit a little unorganized at times. She also gave a lot of group projects though and while I was lucky enough to have super cool teammates who later became my friends, I know some people who didn't enjoy all the group projects (and it was quite a large part of our grade). Also, do take my criticisms of Gary with a grain of salt cause I do have some friends who enjoyed him and preferred him over Deb. "], "url": "https://www.reddit.com/r/UWMadison/comments/8ompib/what_topics_are_covered_in_cs_200/"}