{"title": "Tell me about Math 222.", "body": "I tested out of 221 because my AB calc AP scores. As someone (freshman) who hasn’t taken calculus since junior year of high school, would I get fucked by 222? Isn’t it pretty much BC Calculus? If I end up taking it I will probably do a refresher on calculus on khan academy or something. If you’ve taken it (or preferably taking it this semester) let me know your thoughts, workload, content, and professor quality. Thanks", "comments": ["I know this is not what you asked for but I’mma say it cause I think it can help. Math 221 was literally the same stuff covered by proff Leonard on his calc 1 playlist on youtube. That should be more than enough as a refresher. I watched that playlist before taking the class and I have done great. I definitely suggest giving it a try. About feeling prepared, you could even watch his calc 2 playlist and cover some of the material beforehand.", "I would definitely take a refresher on calc. That being said I didn’t think that conceptually 222 is difficult rather the sheer number of things you need to learn is very overwhelming. Every lecture covers several topics and in order to practice the large number of things you cover every class you are assigned mountains of homework. It’s a huge grind and if you don’t have the mindset that learning is awesome and that you like math you feel dread everyday. My number one tip is to try your best to enjoy learning.", "The dept offers 90 minute refresher power lectures the first week of classs. So you can go in and they will briefly highlight the main points of calc 1 to prep you for calc 2. WOULD RECOMMEND! \n\nSecondly, look at Paul's math notes from Lamar. [https://tutorial.math.lamar.edu/](https://tutorial.math.lamar.edu/) This will save your bacon and really teach you alot. \n\nI was in your same situation. For me, the struggle was just remember all the derivvative rules and devolping that feel for integrals. You need to be able to look at a problem and divine the right approach quickly and accurately. That takes practice so you need to practice those skills again.."], "url": "https://www.reddit.com/r/UWMadison/comments/k5rfvm/tell_me_about_math_222/"}