{"title": "Chem 103 Zelewski vs Weaver", "body": "So I'm in Chem 103 with Professor Zelewski and I'm still reeling from Exam 1, but what makes it even worse is that my friend is in the exact same class but with Professor Weaver. I had a chance to look at their Exam 1 when I was trying to figure out some questions that I didn't understand and the difference is literally laughable. For example, one of the more difficult questions that we were asked was about the soft ionization mass spectrometry of a compound that had differing isotopes. After the taking the exam and seeing the key, I understand how to answer this question, however in class the most in depth we went into soft mass spectrometry was that the compound stayed intact. But to add insult to injury, one of the more difficult questions for Weavers Exam 1 was comparing the movement of atoms to their temperature and taking a gander at what the state of matter would be. This is ridiculous. The average in Zelewski was a 61, while the average in Weaver was something like an 80. I don't even know what I expect to come of this post, but I guess it's a rant about unfairness. Maybe this is normal for college, or maybe it's accentuated because of online learning. Either way, I'm ending up pissed.", "comments": ["The curve is better when the average is low, as sad as it is. In Weaver’s section, only 94-100 is an A. Even a 90 was a B on that exam.", "Yep. I have zelewski too and got a 68, which amounts to a B. Lowkey excited about that, but like you said the quality of teaching seems to be different per section. Clearly the averages distinguish that. Also, our exams took far longer to be graded than the other sections, who got them back within a few days.", "The curve is where it’s at. I understand it’s frustrating to have friends taking exams that are easier than yours but what really matters is how well you perform against the people in your own sections. Just keep that in mind. This class is also preparing you for future stem courses if that’s what your path is. Averages won’t be any higher in Organic chemistry or physics courses."], "url": "https://www.reddit.com/r/UWMadison/comments/j5tra2/chem_103_zelewski_vs_weaver/"}