{"title": "Cs 220 lectures posted online?", "body": "[deleted]", "comments": ["When I took 220 with cole Nelson in spring 2022 lectures for all three professors were recorded and posted online. There were three instructors because hella people take this class. Meena is the principal instructor. Iirc you can also watch them live but I don’t think you could remotely participate in lecture. \n\nLectures were all live coding by the professor aside from exam reviews. They’d walkthrough stuff that would be covered in projects. The class is project-based. There’s like a dozen you have to complete weekly throughout the semester. They’re weighted more than exams. Also there’s weekly quizzes but you get two attempts and they’re open python open notes. \n\nI think you get a late day bank of like 3 or four you can use to turn in projects past the due date without penalty. Otherwise you lose points each day a project is late and you can’t turn in once a week goes by. \n\nThere’s also a weekly lab that is mandatory to attend but I think you could miss a couple per the syllabus. \n\nNot sure about your coding experience but mine was zero to start with and it was a bit of a grind for me. You just have to keep up and practice a little bit each day like any other skill. \n\nYou can code with a partner for each project and they recommend finding one in lab, class, piazza, etc. \n\nI would really recommend finding a partner because it is helpful to bounce ideas off somebody and having a concrete time set up to work on the projects is also good. I worked without a partner early on but then got one and it improved both our time to complete projects a lot. Maybe you could zoom with your partner if you can’t travel. \n\nLastly there’s TA/peer mentor office hours in the cs building and online. They get busy towards the project deadline each week, so I tried going earlier in the week if I had questions with my partner. \n\nKeep in mind my information will be a year old by this spring. I hope this helps.", "This past semester they took attendance at lecture for maybe a month and then it fell through. I also am fairly certain lectures weren’t recorded either, but Meena always posted her code from the lectures. I’m not sure what they’ll be doing with attendance this next semester, seems like a bit has changed between when the other commenter took it and when I took it. So I wouldn’t count on lecture not being mandatory since it seems like they’re moving in that direction", "I took 220 this last semester with Meena and she didn’t post lecture recordings but she did upload completed notebook files from lecture, so if you aren’t a strictly auditory learner then I think it should be doable."], "url": "https://www.reddit.com/r/UWMadison/comments/zwugx6/cs_220_lectures_posted_online/"}