{"title": "Thoughts on Comp Sci 200 (Programming I)?", "body": "What are your guys’ thoughts on comp sci 200 with williams? i’ve heard bad things about the teacher and that it is a ton of work that teaches you nothing, and i’m not sure if that’s correct or not, or if the work is easy. I want to take a comp sci course just to expose myself to it even though i am a psych major and i could be interested in it. would it be worth it to take comp sci 200 first sem freshman year so i will have 13 credits?", "comments": ["Took it without knowing almost anything about CS. My class was online during the semester. You have weekly homework, labs due every other week and a bunch of other stuff. Realistically you can speed run through the homework and never go to lectures and still have a B in the class. The exams are whats tricky. I feel like I learned more doing the lab assignments and then also working with a tutor on them than reading anything. \n\nThe more hands on work you get the better. Its not a hard class.", "intro cs classes like 200/300 often get review bombed (mostly by non-CS majors), but it is definitely a challenging course if it is your first programming experience. However you will definitely learn enough from it to see if its something you are interested in. Also I personally loved Marc’s 200, but Jim seems solid as well", "I took CS 200 with Williams. I had programming experience before the course and was going to skip it, but I knew nothing at all about Java or about object oriented programming, so I decided to take it. I am glad I did.  \n\nI highly recommend the course. I learned many things: about Java, about how to program in general and organize one's code, about how to go about solving problems that are to be programmed, about the computer memory, about how to learn and study, about some interesting mathematical problems, about object oriented programming (even though the course does not emphasize that; it's mostly about procedural programming)... it's a course rich in material. It even has some motiviational material and encourages students to meet and talk to each other. I enjoyed it a great deal.\n\nWilliams is quite knowledgeable about Java, and he also has a strong interest in teaching.  (He has graduate studies in both disciplines). He is a great guy too. Hard to ask for a better qualified teacher! I can't understand why anyone would say negative things about him. \n\nFurther, one aspect I liked a great deal about the course that puts first that the students learn. It sounds strange, but essentially all other courses put first that the students get graded. That's not the case with CS 200, at least with Williams. You can take the same quiz many times until \"you get the grade that you want\" (instructions are worded something like that). The exams can be taken twice. You can submit your code and see it graded automatically right away, and resubmit as many times as you want until works and gets the highest grade. The important thing is that you practice and that you work on the concepts; that is, the important thing is that you learn, not that you get punished with point deductions and unfair exam questions, like in other classes.\n\nIt is a lot of work, though. Programming is learned by practice, and you get lots of it. I was quite busy, but I didn't mind; I want to be a software developer, so I happily plunged into it. If you are just curious, you might conclude the course takes more time than you would have liked."], "url": "https://www.reddit.com/r/UWMadison/comments/wdmhlr/thoughts_on_comp_sci_200_programming_i/"}