{"title": "CS 354 and CS 559/CS 540?", "body": "Next Fall, I'm for sure taking CS 354 and one other Applications class. Right now, I am consider CS 559 or CS 540, but I'm leaning more towards 559 because of interest.\n\nHowever, I talked with my CS advisor, and she recommended taking into consideration on how CS 559 is more project and math heavy so taking it with CS 354 which is also project heavy might not be a good idea.\n\nBut I thought CS 540 also had projects too.... are they not as heavy?\n\nI'd like to know your opinions on it, anything is helpful! :)\n\nedit: thank you for all the responses! i’ll try and get graphics then!", "comments": ["With Sifakis in 559 we had about 7 projects in JavaScript that only took a couple hours each. It is a very mathy course but focuses on the application of math in code rather than memorizing mathematical calculations. 354 is very involved and project heavy but 559 would be manageable. 540 has very long python projects almost weekly so I would recommend 559 because it requires less of a time commitment.", "Yeah don’t take two project heavy courses in CS at once. Especially if you’re like me.\n\nWhen I get stuck on a CS project I’ll spend hours trying to get unstuck. \n\nThe solution is usually something small but the number of hours to find it  can be overwhelming.\nNow imagine have two classes where you can get stuck in this way. Not a good idea.", "I highly recommend CS559 if Efthychios Sifakis is teaching it, it’s way easier than AI. It’s also not that project heavy. \n\nIf Sifakis is teaching it, the projects can be quite easy. You get demo code as a starting point, usually just adding minor changes to the demo code can get you a “3” for the projects. If you want to get a 4 (highest grade) then it takes quite a bit of work.\n\nThe course is graded kinda weirdly though. It takes minimal effort to get at least a B, but trying for an A is harder."], "url": "https://www.reddit.com/r/UWMadison/comments/te4n26/cs_354_and_cs_559cs_540/"}