{"title": "Best first class to get into machine learning (CS 532/539/540 or STAT 451)", "body": "I'll be a sophomore next fall and am interested in machine learning. I'll have completed CS400, CS220, STAT240, and Math340 but haven't taken math234 or 240. Given that I'm taking CS252 and Math234, what is a good third class to either set up good foundational knowledge or project building abilities? I've heard CS540 is less organized and not as good since it's a survey course, but I also don't have as great of a math background without math234 or math240. Given that, should I take CS240 with math234 in the fall first? My fourth class will be an easy gen-ed, so I hopefully won't be overloading myself. I'm generally just confused what the ideal path is for someone into ML but without much pre-req math for true learning in the field. I'll have senior standing, so enrollment will hopefully not be too large of an issue.", "comments": ["I'd say just get CS252, CS240, and Math234 out of the way. Pretty manageable course load. \n\nIf you don't want to take CS240 then take CS532 instead. Honestly, CS540 is not a very good course and I have not heard many good things from CS539 either.", "took both 540 and 539 last sem, DO NOT TAKE 539. it is an absolute waste of time, the prof just spends the first 20 minutes or so of each class reading the slides to you which is absolutely useless, homework and in class exercises are completion based and you receive little to no feedback on them. 540 was okay i’d recommend taking it with prof fred sala if you can", "CompE junior here. I highly recommend getting Math 234 and 240 out of the way ASAP. Those concepts are very applicable to the higher level CS classes.\n\nI haven't taken 532, but my friends who have say it's the best ML class, especially if you were comfortable in Math 340.\n\nAs someone in both 539 and 540 currently, PLEASE DO NOT TAKE 539. I would say 540 is okay (if you do well in traditional lecture classes), as it will definitely give you good foundations in AI/ML topics.\n\n539 is simply a confusing mess of a class. Topics are poorly explained, and instead of assisting students with the flipped-class activities, Professor Hu spends the whole class rambling over the slides. He's a kind fellow and very knowledgeable, but the way he organizes and \"instructs\" 539 is horrendous. Look no further than his [ratemyprofessor page](https://www.ratemyprofessors.com/professor?tid=1202050). On our midterm last week, I know I wasn't the only one who didn't even finish half the thing. AVOID 539."], "url": "https://www.reddit.com/r/UWMadison/comments/11mfbnf/best_first_class_to_get_into_machine_learning_cs/"}