{"title": "Cs 537 OS", "body": "I’m signed up for intro to operating systems next semester and was wondering if anyone could drop a comment abt what the hw and exams are like for it or just like the general workload.", "comments": ["OS was the hardest CS course I took besides 577 algos. \n\nMy biggest tip would be to start the projects as soon as possible, brush up on your C skills. Projects can get very involved. \n\nBut all in all it was a good class and the final curve was very generous. \n\nSource: I just took it this semester with remzi", "Also took it this semester. The grade layout for Remzi was 5% HW quizzes, 45% Exams, 50% Projects. The HW should be a free 100% on each as they are unlimited attempts and moreso meant to keep you on track with the pacing of material. The exams are very fair and if you pay attention in class, go to discussions, and do the HW, you should do fine.\n\nThe projects are where the class becomes notorious. The first one or two were fairly \"easy\" and meant to prepare you. When I say easy, you can still expect to put about in 10 hours, maybe 15 if you are very rusty with C. On the later projects, I spent maybe 20-30 hours on some. Office hours are practically a must to go to unless you are really good at C. (I also didn't have a partner though, so mileage may vary)\n\nNow, saying all that, the tests used to grade the projects are all released partway through each project deadline. This means if you pass all the tests when you turn it in, you will get 100% on the project (except for the scheduler possibly). \n\nI ended with a 78% before the final and got an AB as my final grade. I don't know what the curve was and I don't even know what I got on the final. All said and done, the class is fair and rewards hard work.", "I took it with the second goat Shivaram in 2020 spring. One of the best classes I ever took at this school (besides database 564 and 764). I ended up going to a different school for my phd and guess what I was the best student in their grad OS class and I got A+ at the end. So if you can take with him, do it. 3 easy pieces is also a blessing."], "url": "https://www.reddit.com/r/UWMadison/comments/101k2gg/cs_537_os/"}