{"title": "Math 222 Over Winter Break", "body": "I'm thinking of taking math 222 online over winter break. I tried searching to see if I can take the course over winter break but nothing showed up. Has anyone done it before? If yes, how did it go? If I can't do it over winter break through UW Madison does anyone know other universities or community colleges that do offer it, where my credits would get transferred over back to Madison at the end of the course?", "comments": ["I've never heard of UW-Madison doing 222 over winter. UW doesn't really do any classes of winter as far as I know (besides like some seminars, etc.). Even if you can find it, that class would be fucking insane to do in 4 weeks; I doubt you'd find anywhere that teaches it as thoroughly as UW and would allow you to transfer.", "I took Calc 2 at MATC in 8 weeks, and it was hellish (albeit the professor was terrible and graded very unfairly). You could look at transferology to see an incomplete list of schools that offer a class that would transfer as 222, but I doubt there's anywhere that teaches it in 4 weeks. Schools that have a winter semester are typically on the quarter system, and the winter semester is around 9 weeks long. Quarter system courses also usually don't transfer to UW. \n\nI guess you could try taking a self-paced course and doing it in 4 weeks (I think University of Illinois offers a transferable course through NetMath) but that seems like setting yourself up for failure. You could also self-teach and try to pass out of 222 through credit by examination [https://math.wisc.edu/undergraduate/calculusexam/](https://math.wisc.edu/undergraduate/calculusexam/). But I think your best bet would just be to take it next semester, and potentially take a class next summer if you want to accelerate your time to degree. The 8 week summer courses are condensed enough without trying to cut that in half.", "If you ever need help in maths, Then please check chats, Sent some mentors' info there."], "url": "https://www.reddit.com/r/UWMadison/comments/ywjm3y/math_222_over_winter_break/"}