{"title": "A rant about CS577 with Eric Bach", "body": "This is gonna be a long winded rant, strap in.\n\n1. The course website. If you weren't there on the first day and missed when he wrote the webpage on the board (incorrectly), then sorry! It's not on the canvas, which was made after the class started.\n2. The lectures. I don't think I have referenced my notes once. I and many others I know have stopped showing up completely and it hasn't hindered my performance in the slightest. Going through examples of random algorithms, standing right in front of what you're writing in tiny letters that can't be read, and rambling about nonsense facts for minutes on end in what feels like .5x speed makes for the most dry, useless lecture I've ever had.\n\nIt also means that there is nearly nothing to study from for exams. The textbook examples are so easy they're completely useless. The TAs actively tell us not to study from our notes. The homework, which becomes the only thing I can use as a study reference, didn't have the answers released until the day before the midterm. Also - one of the solutions written by the professor was wrong, according to my TA. This forced me to start studying the day before the exam, for my hardest class. Nice!\n\n3. Now for the BULK of this rant - the grading. Actually, what the fuck. For those who aren't in this class, the only homework that has been graded in full (all 3 questions) is homework 1. Homework 2, which was due October 6, only has 2/3 graded. Homework 3: 2/3 graded. Homework 4: 2/3 graded. Homework 5: 1/3 graded.(homework 4 and 5 have just been graded over the past 2 days, so those are just barely in). This means that it is almost 2 MONTHS since our homework 2 was due, and it STILL is not fully in.\n\nOur midterm, which we had mid October, took over a month to go into the grade book. And when it started to go in, it was graded for about 1/4 of the class on one day, then was removed from the gradebook for them hours later. Then, another chunk of the class had their midterm grades released and those stayed up. For the majority of the class, we did not have our exams put in the grade book for another 4 days. After the drop deadline, which they promised to have them in by. Either way - over a month after the exam was taken.\n\nYes, I submitted my course evaluation, however I don't expect it to do much. I just hate this class.\n\ntl/dr: the lectures are useless, there's nothing to study from, and the grading system is abysmal", "comments": ["I’m with you there. Lectures are just abysmal. Stopped going a couple of weeks ago, and only go to the discussion section, because my TA is wonderful at explaining everything and more that Bach fails to.", "If it makes you feel any better CS 577 is designed to essentially give you a C just for participation as very few people receive a D or F in the class. Anecdotally, I can tell you raw grades as abysmal as a 20% are capable of earning you a C in this class.\n\nUnless you stopped turning in home or started missing exams you'd have to be earning grades that are so abysmal they set historical records to earn less than a C. \n\nThe best way to predict your grade is to analyze the boxplot for your exams. If you're on the mean you'll probably get a C. Slightly above, a B, 2 std. dev. away, an A. Unless you're 2 std. dev. worse than everyone else you'll probably still get a C.\n\nJust take at the [Grade outcome distributions](http://wisc.alext.se/course/1072266577/bbfbbc7759) for your class historically.\n\nFor those of you that have yet to take CS 577, take it in the summer where they just end up covering less material and compressing the class, and if you're afraid you'll miss something b/c you actually want to become an actual computer science or grad student, just self study [Karp's 21 NP Complete Problems](https://en.wikipedia.org/wiki/Karp%27s_21_NP-complete_problems). And always take a look at grade outcomes. Certain professors will curve the average to an AB instead from time to time.", "yeah. my issue with the class is that there is only one week to do the hw. idk why, but this sem assignments have been piling up from other classes as well, there isnt enough time to do them and live a normal life. so i dont even get the full week to work on it, just a day or two as the other days are spend finishing assignments due that day or the next."], "url": "https://www.reddit.com/r/UWMadison/comments/r6vqd3/a_rant_about_cs577_with_eric_bach/"}