{"title": "How bad of an idea is taking CS537 and CS577 in the same semester?", "body": "I've heard from a number of people that CS537 (operating systems) and CS577 (algorithms) are some of the harder CS courses at UW. However, I've found from my previous CS courses here (CS354 for example) that the classes are not as hard as the general public make them out to be. I'm aware 537 and 577 are at a different level than 354 or other basic CS courses, but are they actually as hard as people hype them up to be? I could probably switch things around if taking 537 and 577 together is a terrible idea, but taking them together works way better for my schedule/course plan.", "comments": ["Because who needs sleep right?", "I did exactly this (plus a CS 639 class) and was in a similar boat to you. It was definitely the most work I’ve had in a semester, but I was still able to manage it. That being said, you have to be prepared for long homeworks in 577 and long projects in 537. The homeworks in 577 are no joke, but you also have to take that with a grain of salt because the grading is pretty lenient in the end. In the end, wouldn’t recommend but if you need to do it or want to get them out of the way, it’s definitely possible.", "How much time needs to be put into 577 varies a lot with existing skills and mathematical intuition.  The same homework could take one student one hour and another student ten hours.\n\nFor the average CS student, this is a substantial amount of work, but livable if the rest of your classes aren't hard hitting.  If you are confident that you are a below average CS student and just looking to scrape by with a degree, this is probably too much real difficulty to pack into a single semester.\n\nIf you are looking for materials to prepare with over the summer:\n\n* The [CS537 Book](http://pages.cs.wisc.edu/~remzi/OSTEP/) is free, excellent, and written by Remzi and Andrea.  Probably one of the best 'read on your own' textbooks I have ever seen.\n\n* MIT OpenCourseware has [Algorithms lectures](https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/) available for you to get a decent first pass on the topic with."], "url": "https://www.reddit.com/r/UWMadison/comments/fx1s0s/how_bad_of_an_idea_is_taking_cs537_and_cs577_in/"}