{"title": "CS 559 vs CS 540", "body": "I'm currently enrolled in both and looking to drop one. It's my last semester and going to be my only class besides cs570. As you can see, I'm just looking to graduate at this point. Which course would be best for something interesting but doesn't make me want to die (such as OS, Algos, etc). I'm in Sharon Li's 540 and Michael Gleicher's CS 559. Please be realistic about workload thank u :)", "comments": ["Didn't take 559 but I took 540. The lectures are extremely heavy in mathematical notation and I stopped attending lectures after the second week because I wasn't retaining any information by being present in lecture. I just read the applicable slides to complete each project and did maybe 20 hours of reading slides/taking notes before each exam and got an A/B. It's a doable A if you put effort into it, I just wasn't interested in learning all of the convoluted, multivariable equations that were on every other slide. It's worth noting that the projects have higher weight in your grade than exams, so mastering the math that is taught isn't necessary to get a good grade.\n\nThe projects were also interesting. I liked the one where we coded an AI to make informed decisions in a 2-player, turn-based game. Projects like these provide you with a good foundation to make an interesting side project for your resume. If I had to choose, I'd still definitely do 540 again over 559. Especially if Sharon Li is teaching it (I've heard good things about her).", "I haven't taken 559, but I've taken CS 540 with Yudong Chen. It was a pretty hard class overall; the homeworks were doable, but the exams(especially the first midterm) were challenging. There is a lot of math involved(probability theory, statistics, linear algebra, logic, gradients, etc.) that were covered right off the bat, so having a strong background knowledge in math is definitely helpful. The instructors seemed pretty flexible with the grading scheme based on the student's needs, and were responsive on Piazza. The final curve ended up being very generous, with half the class getting an A and very few grades  <= C. The homework ended up making 70% of your grade, and generally the instructors released partial autograders for the homework. 2 out of 10 HW assignments were dropped. The class uses python and various ML modules like PyTorch. \n\nFrom what I've heard, however, the class can vary between either a soft overview of AI topics and an in-depth focus on machine learning, so IDK how helpful this advice will be to you.", "I’ve taken both and 559 is far easier (and more fun in my opinion) than 540. Though 540 is a good class to take if that’s what kind of topic you want to do further in your career"], "url": "https://www.reddit.com/r/UWMadison/comments/rsdnc3/cs_559_vs_cs_540/"}