{"title": "Going from CS220 to CS300", "body": "I'm currently taking  CS220 this summer and I have a strong understanding of all the concepts.  \nI'm jumping into CS300 in the fall since CS220 satisfied the prerequisite for that class.   \nHas anyone gone this route and how prepared did you feel in CS300", "comments": ["The hardest part of CS300 is just going to be the time commitment each week for the projects. They teach you what you need to know but sometimes the projects can take like 8+ hours. It's a bit of a grind. You'll do fine.", "Also, if you took an intro course in not-Java and are moving to CS300, there will be a 5-week 1cr lab course to help you get up to speed in Java. We're trying to find a good time for it, but looking at MW or TR around 5-6:15 or 5:30-6:45 right now.", "I basically answered this question in a [comment](https://www.reddit.com/r/UWMadison/comments/wdmhlr/thoughts_on_comp_sci_200_programming_i/iilq442/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) yesterday on that person’s question about 200, but to your point:\n\nI took 220 in the spring and am about to finish 300, took it as an 8 week summer course. I have found it to be a manageable transition. Maybe it’s easier because I’m taking it over the summer, as it’s the only class I’m taking—but then again, it’s twice as fast in the summer so maybe that evens it out.\n\nRegardless, I think provided you really grasped what 220 taught you, namely the core intro concepts of coding (basic logic, conditionals, loops, data types, recursion, etc.), the transition is quite doable. I mostly had difficulties in the first week or two, mostly on the first project, as I had to transition my brain from thinking in Python to thinking in Java syntax. Python is very approachable and easy to work with, and while Java i don’t view as crushingly difficult, you need to be patient when making the switch. Note there are online resources available to make the Python-to-Java transition, if you have the energy to seek them out and use them. Once I got the hang of Java, I felt at no disadvantage in the class which I think was far more comprised of 200->300 folks.\n\nSo, is it seamless? No. But it’s certainly workable, just be honest with yourself about your understanding of those main concepts from 220. Besides, there is the possibility in the  alternative taking 200 is potentially spending a semester mostly rehashing a bunch of content you already get."], "url": "https://www.reddit.com/r/UWMadison/comments/wejqji/going_from_cs220_to_cs300/"}