{"title": "CS 200 vs CS 220", "body": "Hey, I have two semesters left, and I’ve always been interested in taking a CS course. Besides the programming language, what are the differences in these two courses, and why should I pick one over the other? I’ve done some coding in matlab for my research lab, but I’m mostly new to all the concepts. \n\nAlso, do either of these classes have partner or group projects?", "comments": ["If you're just looking to add some coding skillz to your toolbox and not go on in CS: **take 220**.\n\nCS 200 is designed as an introduction to programming for people who intend to go on in programming. It's taught in Java, and it's the first course in a three-course sequence. As such, there are quite a few things that get handwaved as \"you'll learn this later, just go with it\".\n\n220's obviously different from 301 as I conceived it, but it's taught in Python and until very recently was a standalone course with no real follow-up. In general, in the non-programmer world, Python will be a more useful language to know than Java, and chances are if you're approaching this as \"hey I wanna take An CS Course\" you're only gonna want to learn one of them. Pick Python.", "Both courses are well designed.\n\nCS200: - Meant for computer science majors/ minors\n\n\\- Exams + projects => total grade\n\n&#x200B;\n\nCS220: - Meant for data science majors, some engineering majors, some other sciences. (Students from psychology, neurobio etc. also have taken this course)\n\n\\-  Exams + projects + few other activities => total grade\n\nWhen I took CS220, I was a student new into programming. Unfortunately I had taken it at a time when many other CS majors (who have had programming experience) had also taken it. Even though I was told that people like me were the target audience, the overall mood during lecture was not very energetic because I could see many CS majors getting bored with being taught the basics of programming. I even messed up on my first exam, which in my opinion was very hard. But to the majority of the class, it was pretty easy. However, I did well on the projects and the rest of the exams and ended up with an AB.\n\nFollowing CS220, I took CS200 because I was not confident enough to do CS300 by myself. I found 200 to be fairly easy. Everything looked familiar and straightforward to me.\n\nSo all in all, what I learnt is that both courses are pretty much the same in terms of difficulty (ATLEAST ONLINE). I suggest you pick one (whatever suits your career path) and get ahead by learning a few key definitions and concepts by yourself. I personally found the 220 projects to be far more interesting : there was one with soccer players, one with movies etc.\n\nOn an average, it is easier to score well on 220 than on 200 because the 200 student body is mainly constituted of comp sci majors and the 220 student body is more diverse.\n\nFor me, 220 projects were pair-programming projects. 200 projects were not."], "url": "https://www.reddit.com/r/UWMadison/comments/ki4ose/cs_200_vs_cs_220/"}