{"title": "CS 540 ", "body": "I am thinking of taking cs 540 in the spring semester of my freshman year. I don't have much experience in programming but  doing pretty well in intro cs classes such as cs 300 (ended up a high A). How difficult is this class and how is the weekly workload and exams? Thank you!", "comments": ["540 is hard. I took it last semester after I did cs 400 and math 340 (linear algebra). The way of teaching is very different from the intro cs classes. There is no ease into the materials nor a structured layout in zybooks. First class the professor went straight to math and I feel like I understood at most 50% of what he said. It continues to be this way throughout the whole semester, at least in me and my friends’ experiences.\nThe class requirement doesn’t justify the difficulty of this class imo. The first half of the semester is pretty math heavy, especially linear algebra. It felt like a math class more than a cs class. There aren’t any hard linear algebra involved, but the professor definitely won’t be explaining what a matrix is. So I would recommend you take math 340 or another linear algebra class first, or study the basics yourself before taking 540.\nThe class has 1 project every week (10 in total but you can drop 2) and 2 exams in total. The projects will not be difficult if you use chatgpt. I did and sometimes it passes all the tests right away, but sometimes it will take hours to fix. Overall I would say the workload is light compared to cs 300. The exams were in person and they were brutal. Even if you get full points on all projects, you still need to do good on exams to get an A. The final grades are curved so that the top 25% ish people get an A (if I remember correctly). I think the curve was pretty big for last semester, somewhere around 89 was the cutoff for A. Before I took this class I saw on madgardes the A percentage is about 40%. I don’t know if they just decided to change the grades distribution last semester or it is the effect of changing from online to in person exams.\nWith all that said, if you still decide to take the class, I have some advice:\nif you feel overwhelmed the first week of 540, just know that most of the students are as well. I wish the professor can lay more context for the materials instead of going straight to math. In retrospect, the concepts from 540 are not that hard to grasp, but in the moment you likely don’t know how each piece connects to one another, and combine that with a lot of math, it becomes hard to understand. But if you study consistently and ask for outside help (chatgpt is pretty good at it) you will succeed in that class. I believe that you are definitely smart enough to do well. But at the end of the day, it is a 500 level course, so be prepared to spend time studying it."], "url": "https://www.reddit.com/r/UWMadison/comments/1i01o5y/cs_540/"}