{"title": "CS564 vs CS640 Next Fall", "body": "I'm planning on taking either CS564 (database management) with Paris Kutris or CS640 with Ming Liu (computer networks) to fulfill my software & hardware requirement for next fall. And this semester, I'm taking CS537 (OS), but the workload is just a bit too much, and I'm not too interested in hardware. Therefore, which of the two classes would you guys recommend to take? Any input will be greatly appreciated! Also, I'm planning on taking a lighter semester, so workload wise, which one would be more manageable? Thanks!", "comments": ["Hey, I took 564 with Paris (and 640 with Suman Banerjee who's great but not teaching it next Fall) and they're both good choices! Without knowing who your professors would be for each course, I don't think there's a wrong choice, so I'd choose first and foremost by the one that seems most interesing to you. Neither is particularly hardware focused.\n\nAs far as workload, they're both somewhat on the easier end of upper level CS courses imo, but 564 being 4 credits vs 640 being 3 credits is about right so you could probably expect to put a bit more time into 564. You do also have to know C++ for two of the 564 projects, so if you're not familiar with the language that takes some extra work since they cover it only very briefly in class (we got a 40 min intro to it).\n\nIf I could've only taken one, I would've went with databases because it strikes me as being more applicable to most people who work in software, but take that with a grain of salt because I'm still in school here too. It's nice to know SQL and how your data's being stored. But I'm sure there's a lot of value in knowing how data makes it between computers and servers as well, especially if you see yourself working on projects where internet connectivity is an important factor. So again, no bad choice!", "I'm in both right now. They're both interesting and useful classes, and I think you'd be happy with either, but here are some details about each:\n\nDBMS (CS564):\n- Requires knowledge of C++ & Python, especially C++ (although you should be able to adapt your C skills from OS)\n- Projects vary greatly in difficulty, some individual and some group projects\n- One midterm, one final\n\nNetworks (CS640):\n- Only requires Java knowledge\n- Projects are fairly straightforward if slightly tedious, all group projects\n- Weekly Canvas discussion posts\n- Four (although one was cancelled, so three) \"quizzes\" which are essentially midterms\n\nNetworks has the smaller workload between the two;  Its projects are simpler and its tests are easier to study for (imo). Both are pretty evenly weighted between projects and tests grade-wise. For both, it helps to know people going in so you'll have good project partners.", "I'll take 640 with Prof. Ming Liu this fall. He has decent grading and curve, although couldn't find his ratemyprofessor page. 564 with Prof. An Doan is my fav session but I couldn't register for since it's full and thus closed. That's my biggest regret. I am not sure who will be teaching 564 in spring 2023, and if I should take 564 in fall 2022 with Prod. Paris Koutris instead."], "url": "https://www.reddit.com/r/UWMadison/comments/u97t4u/cs564_vs_cs640_next_fall/"}