{"title": "CS 320", "body": "How is CS 320? I just took CS220 and didn't do the best. I feel it was really a time management thing though, you know? I'm looking over the course description and it looks like a lot of graphing. I'm assuming you use PANDAS or something? But yeah, I just want to know, in comparison, how hard is it to CS220, and CS200 and then also what the work is like. Are there a lot of projects?", "comments": ["320 is brilliant. Tyler, the instructor, is extremely passionate about teaching the material. he takes real-life examples, codes them from scratch. he covered almost all the popular Python libraries- matplotlib, selenium, flask, geopandas, numpy, sklearn. It's definitely harder than cs 220 and cs 200, and it is project intensive. but you will learn a LOT. Scroll through the course website https://tyler.caraza-harter.Com/cs320/f20/schedule.html", "Just took 320. It is definitely harder, but Tyler is a great prof. There was only one project out of the 7 that was excessively hard, other than that they are all fun and fairly straight forward projects.", "I can offer some minimal insight based off of tutoring 301 and doing all their projects before 320 and 220 were created. (I was CS ‘19)\n\nBecause 220 and 330 are both Python, I’d rank them as easier than a Java course since the projects aren’t as intense. I remember hearing that 320 was mainly visualization (with Pandas and NumPy), which is an important science skill. You’ll probably just be learning how to manipulate and visualize data (effectively). CS200 on the other hand, is more focused on learning fundamental CS concepts and creating standalone programs in Java to do tasks. I would say it’s a more comprehensive introduction and that it will be more technically challenging than 320, since you’ll have to do (what I would imagine would be) more programmatically complex tasks in a language you aren’t familiar with. I’d imagine the 200/300/400 sequence is all project-based (as 302/367 sequence was), and last I saw, 301/220 were weekly projects. \n\nI peeked at [320’s course website from last spring](https://tyler.caraza-harter.com/cs320/s20/schedule.html) and it seems like they have projects every two weeks.\n\nAgain, I’m speaking with limited perspective because the only intro course I took is the now-deprecated CS367. I’d be happy to chat about the upper-level CS curriculum though"], "url": "https://www.reddit.com/r/UWMadison/comments/kj26t6/cs_320/"}