{"title": "Math 222 questions", "body": "Hey, apparently I have to take math 222 next semester, but after receiving BC for 221 and the fact that next semester is going to be online too, I am super afraid. Could you calm me down and answer my questions. Answer at least for 1 and 2. \n1) I heard that you are taking exams every week. Are they hard? Do you still have midterms, finals, homeworks, etc?\n2) HONORLOCK. I didn’t have any exams on honorlock this semester, so I am not sure how this system works. Is it as bad as everyone says? Can I use my notes during exams?\n\n3) which prof to take?\n\n4)How much time, do you spend studying? \n\n5)How to prepare best for it?", "comments": ["1) Exams can be tough, practice algebra - homework, quizzes, exam frequency depends on the professor \n2) I don’t know about honorlock for Calc, I’m out of it — sorry no help here :( \n3) In my experience, it doesnt matter what professor you have \n4) Studied for 2 hours everyday when I got my best exam grades — thats minimum 2hrs a day, some days you do more because the concepts need to be mastered. Then review of week every weekend for 3-4 hours. Best is to do practice problems, write out steps, rinse and repeat while crossing off topics AFTER mastery (dont trick yourself) — build that problem solving accumen \n5) Khan Academy and PatrickJMT + other youtubers. I can honestly say 80% of my learning was through online resources and not UW instructors. once I discovered those resources, attending lectures made me realize how badly things can be taught. If you get lucky with great tA’s attend office hours!!! \n\nIf you have to take it, get yourself in the mindset that no matter how tough it is, you’re ready to commit the time so you can come out a stronger student/get one step closer to your goal at the end of the semester. I never got above 80% and ended up with an AB — I applied the method after figuring out how much of a joke instruction at UW is during Math221 and Math340. Be ready to sacrifice some (not all) fun time if you want good grades! \n\nGood luck 👍🏽", "If Daniel Erman is teaching 222 next semester, try to get him as your professor. He’s hands down the best professor I have had and made 222 my favorite class. I had a similar struggle in 221 and was worried about the next level. Prof. Erman made the class so much more approachable and is an awesome lecturer.\n\nYou still will have to study a lot, in my experience, but I assure you the time you put in to practicing will pay off on exams. The content in 222 is pretty methodical and if you take the homework seriously, do the practice exams repeatedly, go to office hours and make sure you know how to recognize the patterns of solving, you will do fine.\n\nI promise you, the class isn’t as scary as they make it out it be. Having an open mindset about it and a fantastic professor helped me get through.", "Current 222 student here. I’m taking it with Grizzard and I haven’t had a ton of complaints aside from him occasionally not posting the lectures in a timely manner (though he’s getting better). Anyways, onto your your questions. \n\n1. Exams: they’re not too bad if you prep. The problems generally about as bad as a mid-level homework problem, so they’re really not terrible. Some of them will have a little trick or something that you need to use, but there’s always less than five per weekly exam and you’ve got an hour to complete them, so it’s not terrible. Make sure you’ve got good notes and summaries of important theorems and stuff and you’ll be fine. \n\n2. Not that bad except when it glitches out. It’ll sometime miss your face and then you’ll spend ten minutes making weird faces at it to try to get it to reconnect. Otherwise, it’s fine. I have a ton of sketchy ticks (constantly looking down, muttering to myself, looking around my room, etc) since I’ve got ADD, but I’ve never had Grizzard or any of the TAs give me a hard time because of Honorlock flagging me. \n\n3. Bobby Grizzard is pretty good. Not terrible like a lot of other profs, I’ve heard. He really gives you what’s necessary and doesn’t try to show he’s some sort of super math-whiz like some professors I’ve seen. \n\n4. Depends on the material. For the first few weeks I spent 10-14 hours a week since the integrals are kinda tricky. We’re into sequences and series now and I’d say it’s down to 6 hours or so. If you can get past the first five weeks of integrals, you can get through the whole class.\n\n5. INTEGRATE INTEGRATE INTEGRATE. Also review limits a bit and make sure you’re familiar with how to evaluate different indeterminate forms. I would review your trig identities a lot as well, and maybe even work a bit on algebraic things like partial fractions. You’ll use both trig identities and partial fractions a lot when you integrate. \n\nI should say that I currently have around a 91% in the class (good for an A this semester), but would be higher except that I bombed the first test out of pure momentary stupidity. You can get through this, just know the first few weeks are tough but you can get through them. Best of luck to ya!"], "url": "https://www.reddit.com/r/UWMadison/comments/jiyxci/math_222_questions/"}