{"title": "how to study for econ 102 midterm with steven rick", "body": "someone please help me on how to study for his exam. the notes i take in lecture are EXTREMELY UNRELATED to the textbook material. he hardly lectures on textbook related things. with all his blue box facts and random latin phrases, what do i actually study? how do i actually study for this exam in general?", "comments": ["I wish I could say that this is not normal but this was exactly my experience with him last semester. I wished I had followed my friend’s advice: “stop going to lecture, and just deep read the textbook”. \n\nStill go to lecture, but you only need to take notes on the Latin phrases and blue box material. When that comes up, immediately take a picture of it and jot it down. \n\nI would not recommend to paying attention to the rest of the lecture material because most of the facts and figures he presents are not revised nor accurate with actual, up-to-date figures. \n\nLook at old practice exams and do all the textbook prep material. \n\nI went to every lecture and while I got points for all the Latin phrases and some of the blue box material, but I didn’t do much textbook prep. As a result, I ended with a BC. \n\nYou got this! Take a deep breathe. Get some coffee, tea, or something that makes you feel good, and when you are ready, read that darn textbook! You’ll do great!", "basically study the latin terms and the textbook the exam will not cover anything abt Harvey Davidson motorcycles( i hope u get this)", "Can confirm like what the others said. I took his class back in 2019, what he talks is mostly unrelated to what the exams gonna be. He explains okayish but to do well in the exams you gotta do cengage practices (not sure if that's still a thing) but going through the textbook helps alot. I take my own notes. I spend like a good amount studying (2/3 hours daily) and got B (i was 1 point away from AB dangit). \n\nIn hindsight, i dont think the class is that hard but I wasn't doing that many practises to familiarize myself well with the concepts. Never went to Rick's office hours but I did went to the TA's OH which really helped."], "url": "https://www.reddit.com/r/UWMadison/comments/16xngrv/how_to_study_for_econ_102_midterm_with_steven_rick/"}