{"title": "cs 200 best professor?", "body": "hello everyone,\n\n  \nI need to take a cs course next semester, I am currently in cs 220 and I am struggling a little, but at least the exams aren't a huge part of the grade. anyways i want to take cs 200 because i heard its easy, so i just wanted to ask whats the best professor to take it with (ie: if i put in the work ill get an A easily?)\n\nalso what professor offers online midterms because i think that's easier than having to show up n crap lmao", "comments": ["if you have credit for 220 you should progress to 300 or 320. You’ll get much more bang for your buck. 200 will be “easier” but it’ll eat up just as much time as the 300’s from ZyBooks bulk due to being a weed-out class.", "I took both cs220 and cs200 and I’d say 200 is more difficult in terms of content. \n\nThe class itself I took with Jim Williams and he was alright and would code examples and you would have to follow along, a little boring, easy to get lost if you don’t pay attention. There was only one class a week on Wednesday, meaning much of the learning is completely dependent on you teaching yourself the code through zybooks, the online text book. \n\n\nI would say cs200 is more difficult because the weekly projects for Java are far less structured than what they give you in jupyter labs in python. For the projects, they often give you a goal and that’s it, you also have to work with test cases more closely in cs200 java which can be difficult. Finally I think overall python syntax, format and code structure is more intuitive and easier for beginners to learn than in Java, however the concepts themselves are fairly similar. \n\nThe online midterms were nice, however, they are monitored and in my experience more difficult than the python exams but the content is pretty much the same. You also get two attempts, but although they give you the score back on the first attempt, they don’t tell you what you did wrong and also the questions do change so really you have to know the concepts.\n\nI think Java is useful to know and it would be good to learn but wouldn’t recommend the class for an easy A. Overall, it’s like any other class, put in the work and you’ll do decent but imo it’s noticeably harder than cs220."], "url": "https://www.reddit.com/r/UWMadison/comments/1gwq7md/cs_200_best_professor/"}