{"title": "Anyone taken Econ 102?", "body": "Hey there!\n\nI'm registered to take Econ 102 next semester with Steven Rick and was wondering if anyone had any advice for the course? I was also wondering if anyone knows what textbook is used? Was just planning to look a bit ahead so I don't fall behind.", "comments": ["I had Rick for 102 and I also took his course mainly online, so assuming nothing has changed, take good lecture notes from his Blue Boxes and latin terms, which are the only lecture material you'll be tested on. The textbook we used was on Cengage (I forgot the exact title) which is also where most of the exam questions come from.  This will probably be one of the most boring classes you take, but if you understand the textbook questions and take good notes, you'll be fine.", "I took it last semester with Prof Rick too. I personally liked and respected the guy a lot. He genuinely enjoys teaching and he will teach you based current day real world examples which is rlly cool if u like economics. \n\nNow onto the course itself. 50% of the content is what I like to call “real world economics” (this is the stuff from his lectures) and 50% is from the textbook.\n\nYou gotta read the textbook. All the homework will be only on the textbook readings. It’s kinda tedious but as long as you read closely and understand the material, the homework isn’t that bad. I personally took notes on the textbook but I know a lot of ppl just read it and did fine. \n\nThe exams are also pretty doable. The main lecture content is stuff from the blue boxes. The blue boxes are the most important stuff from the lecture but I will say that you should still pay attention to the rest of the lecture too. \nThe rest of the exam content is easy stuff from the textbook. The types of homework question will always be harder than the exam questions. (idk if that’s true for everyone, but it was true for me) \n\nAs long as you take good notes on the blue box and the textbook and put in work, you should have no problem getting an A.\nOverall, I’d say the class is like a 6/10 in terms of difficulty and a 5/10 in the amount of work required to do good."], "url": "https://www.reddit.com/r/UWMadison/comments/l2cr1k/anyone_taken_econ_102/"}