{"title": "Math 222", "body": "[deleted]", "comments": ["i took it as a freshman my first semester. i got a 4 on AP Calc AB. Be prepared that there will be NO review of any previous calculus topics. I took it thinking we’d get some review and I had to do it on my own. I barely remembered how to take a derivative. The class is very heavy, homework isn’t terrible, but very very heavy material. With that said, I learned to learn at a fast pace and felt fine a few weeks in. Later in the semester I got a tutor which helped a ton, but I acclimated to the class pretty well. If you are comfortable and review some Calculus 1 topics, you will be fine. I ended with an AB in the class.", "222 is brutal. Most dropped class at the UW. The homework workload isn’t too bad but just doing the homework will NOT prepare you for exams at all. Expect them to throw stuff at you in the exams that doesn’t look like anything you’ve seen before. If you want to succeed, you need to be attending office hours regularly and dedicating lots of time during the week to solving the extra practice problems they give you during discussion. Start studying for the exams way ahead of time. Go to TA office hours in the Math Learning Center. The TAs are really good.", "I self-learned MATH 222 during the last summer and obtained a 100 in the credit exam\n\nMy suggestions are to read the textbook by yourself and practice discussion problems when you study a new content, and mainly practice the past exams about one week before the exam (one paper per day). You do not need to be stressful during the summer vacation. Just be relaxed and make yourself comfortable, then you can do well.\n\nOne (or some) of exams are hard, and the rest of them may contain one relatively hard problem. You do not need to do perfect. To get an A without a curve (though it always curve), you just need to make sure to obtain about 91% each exam, and the first one tends to be very easy.\n\nIf you find a problem is hard, try your best to show your knowledge to gain partial credits. If one exam is extremely and ridiculously hard, it is highly possible that the curve will be very large."], "url": "https://www.reddit.com/r/UWMadison/comments/1dun9ta/math_222/"}