{"title": "CS 537 (OS) or CS 564 (Databases)", "body": "Everyone I’ve talked to has taken Operating Systems for their advanced elective and said it’s been tons of work. For my elective I’m considering taking Database Management Systems (564) instead, but I know nothing about the content or work of the class.\n\nCould someone who has taken 564 tell me if the class was interesting and what sorts of projects/assignments/exams you had to do? I feel like understanding how databases work is pretty helpful for working in industry.", "comments": ["I would argue that you should take OS. It fundamentally forces you to understand how computers work. I find many people had an 'aha' moment in CS400 where you felt as though you could really program. OS is the same way, it gives you such a great insight into how the machines you're working with work under the hood.\n\nIt also goes into a lot of important topics that are ubiquitous throughout lots of real-world systems (concurrency being the biggest one). If you're planning on working as a software engineer after graduating, I wouldn't pass on OS. It is a good amount of work (not as bad as 577 though). I'm generally a pretty work-averse student but this one is worth it. \n\nDatabases on the other hand is very theoretical. It's a great intro to the world of databases, and some of the knowledge is applicable to real-life; however, what you really need to know about databases can be learned online easily. In addition, it doesn't get into anything other than relational databases, even though document databases are exceedingly popular and graph databases are incredibly important for their use cases. \n\nTLDR: Databases gets *really* into how databaes work. Probably not that helpful unless you intend to presue database work. OS gets *really* into how computers work on a whole, and some important concepts that transcend sub-fields. \n\nOS + DB > OS > DB  (IMHO)"], "url": "https://www.reddit.com/r/UWMadison/comments/t9vm7r/cs_537_os_or_cs_564_databases/"}