{"title": "ECON 102 w/ Steve Rick FUTURE STUDENTS BEWARE", "body": "Just finished my course evaluation for this course and reckon others can learn from my experience. Word to the wise:\n\n&#x200B;\n\nI was very disappointed to find that the lectures were largely unrelated to the material that was being tested. For instance, the week we were studying and doing homework on unemployment, he was talking about housing starts as an economic indicator. He did not even incorporate terms or topics even remotely related to the material tested. Occasionally towards the end, he did have a couple of lectures that were relevant to the homework such as the one on 18 April 2023 where he presented on how monetary and fiscal policy influences aggregate demand. If I were to give a number, I would say about 90% of his lectures were completely unrelated to the homework and what was tested on. It hurts me because I personally highly value lecture time. Thus, to sit at Sewell at 8 am for 75 minutes taking notes on a recycled 97-2003 PowerPoint presentation about the 2008 housing crisis or consumer credit when I need to study about the monetary system felt like a huge waste of time. It kills me that the fruitful and important material I need to study is all in the Cengage textbook. The class in that regard is largely class study. At the beginning of the semester, it was hard to find a seat as there were easily hundreds of students in the lecture hall, but today at the last lecture there were only about 18 students present and it was easy to get a whole row to yourself. It is evident that it is not just me who thinks that his lectures are almost completely worthless. I understand that it may be difficult for him to find time to invest in insightful, up-to-date lectures given his position with the CUNA Mutual Group \\[funny enough he uses that as his main phone instead of his university phone number; same with his email\\], but between thousands of dollars on tuition and $125 for the textbook, I would maximize my consumer surplus and receive more marginal benefit for each hour spent reading the textbook than engaging in class in any shape or form \\[I learned that from Econ 101 with Trost, not you\\]. To that end, the lecture slides he would send us were incomplete or not up to date, so they were inconsistent with what he presented in class. His slides during class always had some additional, “blue box”, information that contained specific, out-of-context and largely inaccurate statistics that would sometimes find their way into tests, which was the only reason I would go to lectures. Similarly, he would also include Latin phrases in lectures that held no significance to the empirical knowledge or terminology we need to know, but would nevertheless compose about 17 to 20% of the test questions \\[for instance, in the 2nd midterm, about 9 questions asked what a particular Latin phrase meant\\]. For instance, today at a lecture some of the Latin phrases were “scio me nihil scire” (I know that I know nothing), “tempus fugit” (time flees or flies), and “rem acu tetigisti” (you have touched the point with a needle)---absolutely irrelevant to the discussion about Philips curves in the long and short run. Thankfully his tests were only 50 questions and all multiple choice, but when less than half of the questions are about latin phrases, the specific number or percent about arbitrary, unrelated, and outdated statistics, and historical facts, I find it difficult to say that I am learning economics. It is so painful to me that this is the case as this class is supposed to be my focus this semester as I am an economics major and I want to dedicate time to this, but I see now that it was a waste of time. I leave this class eager to learn more about economics, not from interest in the material presented this year, but rather the lack thereof. Thank you Professor Steve Rick for the class, and I mean no hard feelings. I look up to you as a model of leadership, determination, and time management, but I needed to be honest about my experience. Wishing you and the family all the best in all your future endeavors! My hope for the future is that future students have a better experience and that they get up-to-date PowerPoint lectures.", "comments": ["TLDR?", "There’s dozens of rate my professor reviews for him complaining about this issue in his classes for years, I don’t think it should be surprising that it was the same way this semester\n\nI majored in Econ and got a BC in my 102 class because the professor wasn’t the best (not Rick but you might have an idea who it is, assuming she’s still at UW) and ended up fine and never got worse than a B in any other Econ class", "This is why I just never went to class when I had him for 302. I just read the book before tests"], "url": "https://www.reddit.com/r/UWMadison/comments/137xa5w/econ_102_w_steve_rick_future_students_beware/"}