{"title": "How is CS320 and Should I Take It?", "body": "For some context, I feel like I’m kinda sub-par coder (coding projects and homework always takes me a super long time to complete) and I have never taken any linear algebra courses and I don’t plan on taking any concurrently with CS320. \n\nHow hard is CS 320? What’s the vibe like? How is the professor? Based off the small description I’ve given at the start of the post should I take CS320?", "comments": ["I'm currently taking it with Tyler! I also feel the same way about coding, I know I can always get the code to run and write it well, but it takes me super long too. In terms of prereqs, you definitely need CS220, but not really any linear algebra (next week we have like 2-3 lectures on it). I'm only in calc 2 rn and haven't had any issues and I don't think I'll run in to any. \n\nThe professor is pretty good. The lectures have been great virtually, and Tyler clearly is very knowledgeable on everything he talks about but also is able to teach it well. About half your grade is projects. You are assigned a group that you can work on projects. I honestly think the groups make or break this class. If you have a good group, you'll be able to collab on projects (and quizzes this semester) and divide the work. If you end up with a bad group and you know early on, reach out to the prof. \n\nIn terms of how hard this class is, I think that depends on your personal definition of hard. I think it truly is a 4 credit class, and you will likely spend about 12/hrs a week on the class. But, I feel you are graded very fairly on codes, the quizzes are collaborative, and the final seems very open ended, similar to a final project.  I don't know the grade breakdown yet, but I am guessing I will get a B or better. So if you want to take it to get an A, I would say maybe not. But, if you are willing to put in the work to get an A, I think you definitely will take a LOT out of it and grow in your data programming skills.  \n\nTl;dr: Yes, but prepare to work a bit for an A", "Hi, I took CS 320 with Tyler during fall 2020 and it was a fun class! Tyler is an awesome professor and he is very helpful during office hours. The only project that was difficult was project 2 or whichever project had decision trees. We learned a lot of material that is important that builds up to machine learning. There is no linear algebra just some stuff on basic matrices. I highly recommend taking this class it is quite fun!", "Hi there, I'm taking CS 320 this semester now, and this is probably one of the most interesting CS class that I have taken or may take in the future. As mentioned by others, you need to put a lot of effort to get an A. I'm taking CS 400 with 320 this semester, and I personally feel like 320 is more fun but in some sense more difficult for me compared to 400. It focuses more on if you know the application of the contents in lecture instead of knowing data structures. I spent 12-15 hours on average to finish each project in order to get full points on those. But still, if you're willing to spend your time and use oh and piazza (this semester's TA's are SO HELPFUL), you will definitely be OK. Wish best of luck! ;-)"], "url": "https://www.reddit.com/r/UWMadison/comments/mgyo24/how_is_cs320_and_should_i_take_it/"}