[{"title": "CS577 final with Marc", "body": "For those who have taken 577 with Marc Renault in the past few semesters, what would you say about his final exam? Is it very difficult? Should I be fine if I understand all of the homework and most of lecture and discussion? What tips would you recommend to score as high as possible? Is getting a 25/50 manageable? Also, does anyone have an idea as to cutoffs for grades?", "comments": ["I thought I failed the class because the final was worth 50% of my grade. I walked out very sad, called my parents and told them I might’ve failed a class. \n\nI ended up getting a B lol \n\nI remember it being quite difficult, I was confident only on 1 question. But yeah, if you understand his notes and examples, you’ll be fine. \n\nYou’ll do fine. Just write something down to get partial credit. Something is better than nothing.", "Honestly was better than I thought it would be. It is definitely challenging but that’s only because the material is kinda challenging. Thoroughly do practice questions before and you should be fine. Also print out all the homworks and sample questions they really came in clutch", "I was very anxious for the final and ended up not getting much sleep the night before. I studied for weeks but I think the sleep was my biggest factor. I ended up with an 18/40 and like the other post I thought I failed. But after all grades were in I had an AB. I did all the attendance and optional zybooks exercises for as much percent as I could get. The final was challenging but if you have a high grade right now, you’ll be fine."], "url": "https://www.reddit.com/r/UWMadison/comments/1c434my/cs577_final_with_marc/"}, {"title": "CS577 final with Marc", "body": "For those who have taken 577 with Marc Renault in the past few semesters, what would you say about his final exam? Is it very difficult? Should I be fine if I understand all of the homework and most of lecture and discussion? What tips would you recommend to score as high as possible? Is getting a 25/50 manageable? Also, does anyone have an idea as to cutoffs for grades?", "comments": ["I thought I failed the class because the final was worth 50% of my grade. I walked out very sad, called my parents and told them I might’ve failed a class. \n\nI ended up getting a B lol \n\nI remember it being quite difficult, I was confident only on 1 question. But yeah, if you understand his notes and examples, you’ll be fine. \n\nYou’ll do fine. Just write something down to get partial credit. Something is better than nothing.", "Honestly was better than I thought it would be. It is definitely challenging but that’s only because the material is kinda challenging. Thoroughly do practice questions before and you should be fine. Also print out all the homworks and sample questions they really came in clutch", "I was very anxious for the final and ended up not getting much sleep the night before. I studied for weeks but I think the sleep was my biggest factor. I ended up with an 18/40 and like the other post I thought I failed. But after all grades were in I had an AB. I did all the attendance and optional zybooks exercises for as much percent as I could get. The final was challenging but if you have a high grade right now, you’ll be fine."], "url": "https://www.reddit.com/r/UWMadison/comments/1c434my/cs577_final_with_marc/"}, {"title": "CS577 Finals", "body": "For past and current CS577 students, how do you prepare for the finals? What is the most effective way to prepare for a final paper to maximize your score? Thanks!", "comments": ["Hey I'm one of the peer mentors for CS577 this semester. I will be uploading my refined cheatsheet from my last semester to Canvas tonight. I will send a piazza announcement about this, and I hope my cheatsheet can help you start your review. :)", "For CS577?  Learn the material as you go, understand how to apply it and how to prove that your application is correct.  It isn't a class you can effectively cram for or produce a magical cheat sheet for."], "url": "https://www.reddit.com/r/UWMadison/comments/ulgqvb/cs577_finals/"}]