[{"title": "CS 537 (OS) Resources for Prospectives, and Exams", "body": "Hi All,\n\nI've heard a lot of CS majors are confused about whether to take OS or not, the positives, the negatives. I am not here to give you my opinion, rather I want you to assess for yourself. This is a hefty class, and it is worth researching whether you want to take it or not.\n\nI have compiled a bunch of Remzi's lectures so far for you to watch. imo these are some of the best lectures on campus and I really enjoy them.\n\nFurther, there is a link to projects on the bottom. Please look through the readme files on these projects. These will take up your weekends easily (I spent about 38 hours on the project due 2 days ago, and it wasn't even the hardest project.\n\n[https://docs.google.com/document/d/1TcypnhvnGILCWb0F-N9xpU2OdqMzbyPr3v7nlytRe80/edit](https://docs.google.com/document/d/1TcypnhvnGILCWb0F-N9xpU2OdqMzbyPr3v7nlytRe80/edit)\n\nHere is a link to the official class (there is no canvas page, all the course material is on this website and on piazza):\n\n[https://pages.cs.wisc.edu/\\~remzi/Classes/537/Fall2022/](https://pages.cs.wisc.edu/~remzi/Classes/537/Fall2022/)\n\nHere are project solutions ( the description of each project is found in the link above)\n\n[https://github.com/devang-m/CS537](https://github.com/devang-m/CS537)\n\nWhether you're studying for exams, or just thinking about taking OS or developing interest in it, I highly recommend watching lectures. CAUTION: you may fall in love with Remzi.\n\n&#x200B;\n\nPAST PAPERS: [https://pages.cs.wisc.edu/\\~remzi/Classes/537/OldExams/](https://pages.cs.wisc.edu/~remzi/Classes/537/OldExams/)", "comments": ["thank you very much! :)", "Really helpful!"], "url": "https://www.reddit.com/r/UWMadison/comments/y59o00/cs_537_os_resources_for_prospectives_and_exams/"}, {"title": "CS 537: Operating Systems, is it worth it? How valuable is it?", "body": "Hi, I’m going to be a senior next fall and I wanted to hear people’s opinions on CS537, Operating Systems, and why it’s a good class. I’m aware it’s a lot of work, so is it worth the pain? \n\nThanks!", "comments": ["I took 537 a few years back with a new professor using Remzi’s book, was hard and made me sad, and don’t directly use it in the field, but looking back it was an interesting course and the topics addresses are good for software development. But I guess it really depends what your future plans are (CS/software dev/embedded engineer/etc) (I just do stuff on the back end in Java)", "I'll date myself as I graduated in 2012 and have been in the programming field for 10 years now. I thought CS537 was interesting and you learn some cool stuff but I regretted not taking CS564 Database Management Systems as I realized that was much more practical for standard work in the field. Can't go wrong either way, just my two cents if you haven't taken the other!", "I would say it should be required. I took it with Remzi and it really wasn't that hard. Plus it's basically the only course that teaches you about threading, how to implement it, and how to use it."], "url": "https://www.reddit.com/r/UWMadison/comments/ty1isp/cs_537_operating_systems_is_it_worth_it_how/"}, {"title": "Don't Take CS 537!", "body": "Don't do it.  It is terrible.\n\nThe amount of work is incredible as is the difficulty of it.  I have taken all the usual cs classes up to algos along with 435, 559, 564.  Projects 3 and 4 in 537 were both more time consuming and difficult than the final B+ tree project in 564, which is known to be difficult.  There is 7 projects in this class!  Debugging these projects is nearly impossible, and usually figuring them out comes down to trying random things until it works.  You also need to sift through all the discussion videos put out by the TAs and hope that they haven't accidently steered you wrong.\n\nTo make matters worse, there's no break from projects to take exams.  The last 2 exams have both been less than a week before or after the incredibly hard projects were due.\n\nAnd with all of this, lecture attendance is mandatory!  Doesn't count for much, but enough to make you feel you need to actually go.  Andrea seems like a nice lady and like she's trying her best, but she goes really fast in lecture and has sloppy handwriting.  The lectures help very little with the projects.\n\nFind a different class for your software hardware requirement.", "comments": ["I took it last year with Miller and I thought it was the best class I've taken here in terms of content and practical usefulness. 10/10 textbook too. It sounds like they may be cramming too much stuff into the semester this time around, which is unfortunate.\n\nEdit: I can't vouch for anyone else, but I 100% recommend taking OS with Miller", "Alright before everyone that was planning on taking this class and steers clear of it after reading this post, 537 isn’t as bad as OP made it out to be. I mean it’s a 4 credit class upper level cs course that’s one of the “must take” courses for any cs major. It’s going to be harder than other cs classes. \n\nYou definitely have to get started on the programs right away and use the lab hours. You get 2 weeks for each program and 75-80% of the students don’t start till the second week and lab hours are always crowded during the second week. If you start early, you can abuse the shit out of lab hours and ask for any little clarification. \n\nI do agree she goes fast in lectures but you can always rewatch them right after. I’ve been going to lecture and then later that day or next day, I re watch them. The textbook is a really good source too because her and remzi wrote the fkin book and they teach straight from it. \n\nAs for the exams, they’re pretty much what you learn in class. What you learn in lecture is what’s on the exam. True false questions and multiple choice questions. Pretty straightforward. I haven’t seen a single questions that I thought we didn’t cover it in class. \n\nOverall, I highly recommend taking this class.", "Don't take CS 537 during a pandemic , that's for sure. Also know what you're getting into ahead of time. For me, that was my favorite CS class I took, and I had it with Andrea. I liked it for the difficulty, and really felt it was a rite of passage. And yes, the projects in that class are time consuming, one in particular, a scheduler I believe, ended up taking me on the order of 40 hours. If you can't take the heat, get out of the kitchen!"], "url": "https://www.reddit.com/r/UWMadison/comments/mqensb/dont_take_cs_537/"}]