[{"title": "Econ 102 Online - Spring", "body": "Who should I take Econ 102 online with? Looking for a professor who is best at explaining the concepts well? Can take with - Steven Rick, David Johnson, or Stella Chan.\n\nThanks in advance", "comments": ["Always David Johnson. Always.", "I’ve always heard David Johnson is great, but I took Econ 102 this semester and I’d also strongly advocate for Stella Chan. She’s very good at explaining concepts, is well organized, has a ton of office hours before exams, and I think the class had been adapted pretty well to online. This is coming from someone who hated Econ 101 and is struggling with online classes a bit in general. There’s also no Honorlock (we have open note/book exams) so that’s pretty great.", "Johnson is entertaining and likes to curve. Steven Rick is pretty chill though"], "url": "https://www.reddit.com/r/UWMadison/comments/k6pgbw/econ_102_online_spring/"}, {"title": "Difficulty of Econ 102", "body": "I took Econ 101 in fall 202 and planning to take 102, I found econ 101 quite interesting. How challenging is econ 102?", "comments": ["To be honest, it seems like econ 102 material is easier than 101. But again it depends whether you like macro or microeconomics. Try to take it with Chan because her transition to online was fantastic and I honestly stopped reading the textbooks after 1st exam and just watched the lectures. Anyways, if you found 101 interesting and not extremely challenging, I am sure that you will love 102 as well", "Most people here found 102 easier. Personally, I found it harder, but that could also be because I spent much less time on it. I found Econ 101 much easier, but I found both clases very interesting and relatively simple. \n\nFor context I got an AB on both classes."], "url": "https://www.reddit.com/r/UWMadison/comments/kivz42/difficulty_of_econ_102/"}, {"title": "how to study for econ 102 midterm with steven rick", "body": "someone please help me on how to study for his exam. the notes i take in lecture are EXTREMELY UNRELATED to the textbook material. he hardly lectures on textbook related things. with all his blue box facts and random latin phrases, what do i actually study? how do i actually study for this exam in general?", "comments": ["I wish I could say that this is not normal but this was exactly my experience with him last semester. I wished I had followed my friend’s advice: “stop going to lecture, and just deep read the textbook”. \n\nStill go to lecture, but you only need to take notes on the Latin phrases and blue box material. When that comes up, immediately take a picture of it and jot it down. \n\nI would not recommend to paying attention to the rest of the lecture material because most of the facts and figures he presents are not revised nor accurate with actual, up-to-date figures. \n\nLook at old practice exams and do all the textbook prep material. \n\nI went to every lecture and while I got points for all the Latin phrases and some of the blue box material, but I didn’t do much textbook prep. As a result, I ended with a BC. \n\nYou got this! Take a deep breathe. Get some coffee, tea, or something that makes you feel good, and when you are ready, read that darn textbook! You’ll do great!", "basically study the latin terms and the textbook the exam will not cover anything abt Harvey Davidson motorcycles( i hope u get this)", "Can confirm like what the others said. I took his class back in 2019, what he talks is mostly unrelated to what the exams gonna be. He explains okayish but to do well in the exams you gotta do cengage practices (not sure if that's still a thing) but going through the textbook helps alot. I take my own notes. I spend like a good amount studying (2/3 hours daily) and got B (i was 1 point away from AB dangit). \n\nIn hindsight, i dont think the class is that hard but I wasn't doing that many practises to familiarize myself well with the concepts. Never went to Rick's office hours but I did went to the TA's OH which really helped."], "url": "https://www.reddit.com/r/UWMadison/comments/16xngrv/how_to_study_for_econ_102_midterm_with_steven_rick/"}, {"title": "Econ 102 Grade...How doomed am I?", "body": "Okay, Okay, So,\n\nI am a sophomore in Econ102 with Stella Chan and recently got back my second midterm...and I got a pretty bad grade. Right now I'm sitting with a 79% in the class overall, I attend every discussion, and do fairly well on the problem sets.\n\nMy questions:\n\nIs there a class curve?\n\nWhat is the final like?\n\nWhat is the most effective way to study?\n\n&#x200B;\n\nThanks!", "comments": ["Ask the professor/TA if you're trying a lot of teachers will keep you from failing if that's your concern. Also drop deadline is Friday, so ask now. \n\nYou could also look into calculating your grade in a spreadsheet and seeing what grades you need on assignments to pass.", "AFAIK a lot of classes in the econ dept are curved, and many of them are curved heavily by percentile class performance. you can tell by the fact that letter grade distributions for econ courses (see [madgrades.com](https://madgrades.com)) are pretty constant, with the top \\~15-20% of students getting As, the next 15-20% getting ABs, and so on. if your syllabus doesn't mention anything about this, email your TA and professor about your standing in the class.  \nI can say from experience that doing well in an econ class is all about practice. do lots of practice problems, go to office hours and get every step of the math explained to you."], "url": "https://www.reddit.com/r/UWMadison/comments/z2cxdm/econ_102_gradehow_doomed_am_i/"}, {"title": "Econ 101 vs 102", "body": "How difficult is Econ 102 compared to 101.? Is Gwen Eudey better than Stella for 102?", "comments": ["101 has more algebra like problems while 102 is more theory based... Gwen is great for 102.... Both classes are about the same difficulty imo", "Gwen Eudey is a great professor. Highly recommend her, even if it means an early lecture. She makes it worth it.", "i did both this summer! had johnson for 101 and eudey for 102.\n\npersonally, i liked the formatting of eudey's class a lot more. as others are saying, it's a bit more humanities-esque based, which can be a pro/con depending on who u are. \n\nbut also, there are 2 midterms and she drops the lowest one, i got a 31/35 on the first this summer and a 29/35 with little studying (my friend did the same and she got a 32/35 on the first midterm this semester, so it's not just a summer school thing)."], "url": "https://www.reddit.com/r/UWMadison/comments/rajowq/econ_101_vs_102/"}, {"title": "Econ 102", "body": "I’m taking Econ 102 in the fall with Steven Rick. I’ve heard mixed reviews about his way of teaching. For anyone who has taken Econ 102 with Professor Rick, how should I prepare for his course (lectures and his exams)? What kind of textbook does he use? ", "comments": ["Do not take it with Steve Rick!! He will not teach the material at all. Be prepared to learn some random Econ things that u will be putting on his slides (blue notes) which are incredibly huge amount of info that he will put on the exams. Plus for some reason he will be teaching Latin. There will be Latin phrases questions on the exam. Avoid the hassle and do not take it will him", "I agree with the other comment here. If you take it with Steve, you will be teaching yourself the whole class and relying heavily on your poor TAs. His \"blue box\" info on exams only makes up about 20% of exam material and he does not teach the textbook."], "url": "https://www.reddit.com/r/UWMadison/comments/1cod6sk/econ_102/"}, {"title": "Anyone taken Econ 102?", "body": "Hey there!\n\nI'm registered to take Econ 102 next semester with Steven Rick and was wondering if anyone had any advice for the course? I was also wondering if anyone knows what textbook is used? Was just planning to look a bit ahead so I don't fall behind.", "comments": ["I had Rick for 102 and I also took his course mainly online, so assuming nothing has changed, take good lecture notes from his Blue Boxes and latin terms, which are the only lecture material you'll be tested on. The textbook we used was on Cengage (I forgot the exact title) which is also where most of the exam questions come from.  This will probably be one of the most boring classes you take, but if you understand the textbook questions and take good notes, you'll be fine.", "I took it last semester with Prof Rick too. I personally liked and respected the guy a lot. He genuinely enjoys teaching and he will teach you based current day real world examples which is rlly cool if u like economics. \n\nNow onto the course itself. 50% of the content is what I like to call “real world economics” (this is the stuff from his lectures) and 50% is from the textbook.\n\nYou gotta read the textbook. All the homework will be only on the textbook readings. It’s kinda tedious but as long as you read closely and understand the material, the homework isn’t that bad. I personally took notes on the textbook but I know a lot of ppl just read it and did fine. \n\nThe exams are also pretty doable. The main lecture content is stuff from the blue boxes. The blue boxes are the most important stuff from the lecture but I will say that you should still pay attention to the rest of the lecture too. \nThe rest of the exam content is easy stuff from the textbook. The types of homework question will always be harder than the exam questions. (idk if that’s true for everyone, but it was true for me) \n\nAs long as you take good notes on the blue box and the textbook and put in work, you should have no problem getting an A.\nOverall, I’d say the class is like a 6/10 in terms of difficulty and a 5/10 in the amount of work required to do good."], "url": "https://www.reddit.com/r/UWMadison/comments/l2cr1k/anyone_taken_econ_102/"}, {"title": "is econ 102 curved?", "body": "i have steven rick, and i can’t find if the class is curved anywhere. does anyone know if it is???", "comments": ["I have Steven Rick too. I'm not sure if the class is curved but the tests definitely are. He sends out emails regarding their curves.", "I took econ 102 w steve rick, i think i got an AB on canvas but my official grade was an A"], "url": "https://www.reddit.com/r/UWMadison/comments/17xpeky/is_econ_102_curved/"}]