[{"title": "CS540 Midterm Materials", "body": "Those who previously took the class, how did you prepare for exams. The slides are pretty surface level and are missing explanations for most of the concepts. I found videos of lecture from fall 2018 but they seem to have altered the syllabus since then. Looking for any help.", "comments": ["i got wasted at state street brats", "Dude it’s so easy idk what you mean \n\nJust check the previous semesters midter-oh wait they’re nothing like this semesters material \n\nWell okay, go over the breaks and quizz-oh wait many of the slides were skipped and I’m not sure if they’re gonna be on the exam \n\nFine, just go over the review materia-oh wait there is no review material given \n\nOkayyyyy yeah we’re fucked", "i withdrew"], "url": "https://www.reddit.com/r/UWMadison/comments/11ikgwo/cs540_midterm_materials/"}, {"title": "CS540 Yingyu Liang Grading Threshold for B/AB/A", "body": "Simply title, if anyone has taken CS540 Intro to Artificial Intelligence, wanted to ask what the grading threshold for a B and AB and A are specifically. I stand at an 86%, calculated median is 91.8%, mean is 82%. What is the cutoff for an AB or A?", "comments": ["I am wondering the same sitting at a 86 too", "They just posted the grade distributions on piazza"], "url": "https://www.reddit.com/r/UWMadison/comments/zsscdz/cs540_yingyu_liang_grading_threshold_for_baba/"}, {"title": "CS 540 Intro to AI", "body": "The professor just explained at the end of the lecture how 540 will be building on the foundations of linear algebra and topics like linear algebra, matrices, vectors, matrix multiplication, what it means to have a reverse matrix, etc. I have no knowledge of any linear algebra and I don't know much Python. Can I still do well in the class (can I get an A) with the current knowledge I have or will it be too difficult? Thanks", "comments": ["I have taken CS540 and Linesr Algebra should almost be a prerequisite. You’ll use matrices a fair bit, but not to the full depth of Linear Algebra. I’d watch some videos to get a good grasp of it", "I would suggest starting with 3blue1brown videos. I haven't taken CS540 yet but when I took linear algebra it was a great way to get my basics right and improve my understanding."], "url": "https://www.reddit.com/r/UWMadison/comments/16dtgsy/cs_540_intro_to_ai/"}]